{"version":"https://jsonfeed.org/version/1","title":"Daniel Doblado","home_page_url":"https://dobla.do","feed_url":"https://dobla.do/feed.json","description":"Personal site of Daniel Doblado","icon":"https://dobla.do/orb512.png","favicon":"https://dobla.do/orb48.png","language":"en","authors":[{"name":"Daniel Doblado","url":"https://dobla.do","image":"https://dobla.do/orb512.png"}],"items":[{"id":"https://dobla.do/blog/fixing-a-yamaha-dgx-620-screen/","title":"Fixing a Yamaha DGX-620 grand piano screen","url":"https://dobla.do/blog/fixing-a-yamaha-dgx-620-screen/","summary":"How I got my piano and the problems of fixing it","date_published":"2023-01-01T00:00:00.000Z","content_html":"<p>import YoutubeVideo from \"#astro/components/YoutubeVideo.astro\";</p>\n<h2>Introduction about the piano</h2>\n<p>I bought a second hand <a href=\"https://en.wikipedia.org/wiki/Yamaha_DGX-620\">Yamaha DGX-620 Grand Piano</a> also known as the &lt;i&gt;YPG-625&lt;/i&gt;, the &lt;abbr title=\"Yamaha Portable Grand\"&gt;YPG&lt;/abbr&gt; stands for Yamaha Portable Grand, sure portable..., after carying it for 10 minutes by myself my back hurt for 3 days.</p>\n<h2>Opinions and problems</h2>\n<p>Overall I'm very happy with it, while I still don't know much about playing paino, it does look and sounds great, but it came with problem that bothered me a lot, that the seller did not mention it until I went to buy it.</p>\n<p>The screen was broken, it's a common known manufacturing problem for these models that looking online affects a lot of people, fortunately due to this reason I got a huge discount, only 70€ to buy the full piano, there's people selling it with a broken screen for around 200 € minimum, the cost new was of ~700€ so a 90% discount.</p>\n<p>The problem is very simple, the ribbon connector for he display loses connection overtime, due to a very thin solder that's in tension.</p>\n<h2>Possible first solution</h2>\n<p>This video shows a very simple solution which seems to work for most who tried, simply add foldback clips to increase the preassure of the connection.</p>\n<p>&lt;YoutubeVideo\nloading=\"eager\"\nvideoId=\"JNsmoBEO4nI\"\nvideoTitle=\"Yamaha YPG / DGX LCD Screen Fix, Easy &amp; Fast\"\n/&gt;</p>\n<p>This solution sounds great, low repair cost (only 2 foldback clips), without much risk besides open it, so I tried.</p>\n<p>After removing around 100 screws (that was painful), the case can be removed and the board can be accesed.</p>\n<p>Now that's open the process it's easy, after remvoving the ribbons and the 4 screws around the board, the main board will go out and the display can be accessed.\nThe display has two ribbons that each control half of the screen, I had to fix both in my case, so this requires to remove 2 additional screws to acces the second ribbon.</p>\n<p>I isolated the clips with masking tape, to make sure the circuits will not short with the metalic clips.</p>\n<p>After this I checked the screen and unfortunately it only fixed half of it, I tried adding more pressure, but nothing worked, so I gave up after a while.</p>\n<h2>Second option</h2>\n<p>At this poin I thought my only solution was to replace the screen, this was problematic for two reasons, number one, a new screen cost a minimum of <a href=\"https://de.aliexpress.com/item/1005004712449602.html\">60€ on aliexprss</a> sometimes as much as I paid for the whole piano, reson two is that it requires an iron solder.</p>\n<p>I did want an excuse to buy a <a href=\"https://pine64.com/product/pinecil-smart-mini-portable-soldering-iron/\">PINECIL</a>, an amazing tool, but this will add to the cost, and I decided it was not worth it, besides the piano works great, and the MIDI input can be used without a screen.</p>\n<p>Here it's when I thought of a differnet solution that so far I didn't see online, if the solder had desolder why not try to melt it, I do not have a heat gun but I do have a hair dryer so I gave it a try.</p>\n<p>The process is almost the same but instead of adding pins for preassure, I just heated both screen connectors for around 5 minutes using the hair dryer's max temperature, somtimes adding preassure with the plasticl nozzle.</p>\n<p>After mounting it again I got a gorgeous working screen.</p>\n<p>&lt;YoutubeVideo\nvideoId=\"fPGboN25uWo\"\nvideoTitle=\"Yamaha DGX-620 Grand Piano Screen Repair\"\n/&gt;</p>\n","tags":["piano","repair","Yamaha DGX-620","screen","DIY","hardware"]},{"id":"https://dobla.do/blog/geomask/","title":"GeoMask: geolocation spoofing extension for Firefox and Chrome","url":"https://dobla.do/blog/geomask/","summary":"A way to easily spoof your geolocation in Firefox and Chrome for development and privacy purposes.","date_published":"2025-12-15T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>Earlier this year I switched back to Firefox, I want to move away from Google services as much as possible, and one feature that I used sometimes was the ability to spoof my geolocation, not even for nefarious purposes or privacy, mostly for development.</p>\n<p>This is something really easy to do on Chrome, without even having to resort to extensions, simply open the developer tools, go to the \"Sensors\" tab and change your location to whatever place you want, I wish Firefox had something similar built-in, but it doesn't.</p>\n<p>My first attempt was to use an existing extension, I couldn't find any that worked well, most of them were either outdated, not working at all, or had the most unintuitive user interface imaginable.</p>\n<p>When there are no good options, the best option is to make your own, so I created <a href=\"https://github.com/dobladov/geomask\">GeoMask</a> following the development mindset that I'm going to call \"Better Execution, Same Task\" (BEST), the idea is to look at existing solutions, see what they do well and what they don't, and then make something that does it slightly better in each aspect, nothing groundbreaking.</p>\n<h2>Goals</h2>\n<p>Let's start by understanding the main feature, <strong>changing the location directly in the extension popup</strong>, this might sound crazy but most of the extensions I tried, required an options page buried in settings or navigating to a hosted webpage where JS is injected to add UI where the location can be set, and most of those sites are offline and not maintained anymore.</p>\n<p>I believe these extensions have weird designs because of how limited and hard to work with the WebExtension APIs are, even more after manifest v3 changes, most of the code has to run isolated from the extension UI, requiring to add weird communication between layers, inject scripts which are very limited, etc, I don't want to rant much about it, but clearly Google does not like extensions and it's forcing Mozilla to follow their enshittification practices.</p>\n<p>My extension needs to do the minimum as Google's devtool, a popup with two text fields for latitude and longitude, and a button to apply the changes, and what can be better than that?, if the popup also shows a map with a pin that can be dragged to change the location visually, and search box to find places quickly.</p>\n<h2>Development</h2>\n<p>With that in mind, I created a simple map with <a href=\"https://leafletjs.com/\">Leaflet</a>, my initial thought was to use <a href=\"https://d3js.org/d3-geo\">d3-geo</a> with a self contained geojson map of the world, but leaflet gives a lot of features out of the box, zoom, panning, and more rich map information, in my opinion is a worthy dependency.</p>\n<p>Now that I have a map, I can set coordinates, change the position easily, I need to do the most annoying part of this project, overriding the browsers's <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Navigator/geolocation\">geolocation API</a>, with the selected coordinates.</p>\n<p>For that the <a href=\"https://github.com/dobladov/geomask/blob/main/extension/popup/popup.mjs\">popup</a> needs to be able to store the coordinates using <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Storage\">browserAPI.storage.local.set</a>, then a <a href=\"https://github.com/dobladov/geomask/blob/main/extension/content.js\">content</a> script listens to storage changes with <code>browserAPI.storage.onChanged.addListener</code> in order store the coordinates on the page context, but unfortunately a content script cannot override the geolocation API directly, so it needs to <a href=\"https://github.com/dobladov/geomask/blob/main/extension/inject.js\">inject</a> a <code>web_accessible_resources</code> that overrides the <code>navigator.geolocation.getCurrentPosition</code> and <code>navigator.geolocation.watchPosition</code> methods to return the spoofed coordinates, where this data can be read from the <code>root.dataset</code>.</p>\n<p>At this point I had a functional extension that could change the location, to polish it a bit more, I added a search box using <a href=\"https://nominatim.org/release-docs/develop/api/Search/\">Nominatim</a> to find places quickly, a way to reset the location to the real one, dark and light mode, some error handling for invalid coordinates, and a randomize button with distance options.</p>\n<p></p>\n<p>For the extension itself I decided to use vanilla JS with <a href=\"https://jsdoc.app/\">JSDOC</a> types validated by typescript to avoid any build step and no UI frameworks, given that there's not much UI, keeping the extension lightweight and simple, <em>92.1 KB</em> for <a href=\"https://github.com/dobladov/geomask/releases/tag/1.0.0\">1.0.0</a></p>\n<p>The extensions should be available soon once approved.</p>\n","tags":["extension","geolocation","firefox","privacy","chrome","web-development","javascript","typescript","web-extensions","addons","leaflet","d3-geo","nominatim","mapping"]},{"id":"https://dobla.do/blog/why-newsletters-are-not-ideal/","title":"Why newsletters are not ideal","url":"https://dobla.do/blog/why-newsletters-are-not-ideal/","summary":"I don't like newsletters, and why I prefer RSS","date_published":"2022-05-10T00:00:00.000Z","content_html":"<h2>Problems</h2>\n<p>You enter a site, and the first thing you see is a popup asking for your email, that's plain rude, or even worse, you start reading the article, and it pops up asking and interrupting your reading.</p>\n<p>Please add the banner at the end of the article; if your article is good, I might give it a try.</p>\n<p>Let's say that I agree and write my email; now I have to trust that the site won't be hacked, or directly sell my email to a third party.</p>\n<p>I might get your new information in a neat and nice email, but again, it's your choice to send spam, and let's say you do, this could happen with RSS, but there's a main difference, that's unsubscribing, and here is where the problem begins.</p>\n<p>There are so many sites that have broken unsubscribe pages, it's a link that devs don't usually visit and rarely gets any maintenance, so if it does not work now, I have to contact the company directly, and if I'm lucky, it will be sorted out, if not, I have to completely block your email address, which might be a problem if I want other updates.</p>\n<h2>Why RSS is better</h2>\n<p><a href=\"https://de.wikipedia.org/wiki/RSS_(Web-Feed)\">RSS</a> completely avoids all those problems.</p>\n<p>It does not ask you to send your email; you gather the data whenever you want, and your email is kept private, there's no need to trust the site with privacy.</p>\n<p>Unsubscribe is always on your side; just remove the URL from your client and you're done, no need to contact anyone, no need to trust the site to do it for you.</p>\n<p>RSS can be tailored; some sites separate their feeds by category, so you can choose what you want to read, yes there are some newsletters with preferences that require an account again more work for both, but with RSS, you just choose a URL and be done with it.</p>\n<h2>Advantages of newsletters</h2>\n<p>Being fair, probably all people on the internet have an email, which makes it easier to reach, and most people don't know what RSS is, so it's easier to explain to someone to subscribe to a newsletter than to an RSS feed.</p>\n<p>There are more email providers giving completely free service than RSS readers, the moment you want to sync between devices, you have to pay for a service, or self-host, while email is mostly free.</p>\n<h2>Conclusion</h2>\n<p>RSS declined with social platforms removing support, especially when Google Reader decided to close, and when browsers removed integrated support for it (yes Firefox I'm looking at you).</p>\n<p>If you care about privacy, RSS is the way to go, and it's sad that the tech that respects users the most is dying.</p>\n<p>I'm extending this section now with other articles that promote RSS:\n- <a href=\"https://reedybear.bearblog.dev/ive-been-advocating-for-rss-support-and-you-should-too/\">I've been advocating for RSS support, and you should too</a>\n- <a href=\"https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/\">I Ditched the Algorithm for RSS—and You Should Too</a></p>\n","tags":["opinion","newsletter","email","rss"]},{"id":"https://dobla.do/blog/become-your-companys-javascript-janitor/","title":"Become your company's JavaScript janitor","url":"https://dobla.do/blog/become-your-companys-javascript-janitor/","summary":"How to keep your JavaScript dependencies up-to-date and learn new things in the process","date_published":"2023-08-16T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>How many times do you work on a project and many dependencies are outdated, and neither you nor your colleagues want to take care of them because it's a huge tech debt task, especially with major versions?</p>\n<p>This might not happen if you take care of your dependencies regularly; even better, it can be an opportunity to improve your codebase and learn new things that new versions bring.</p>\n<h2>Basic solutions with npm</h2>\n<p>The simplest way to see if there are new versions of your dependencies is to run <code>npm outdated</code>, this command will show you the current version of your dependencies and the latest version available, pretty useful to get an overview.</p>\n<p></p>\n<p>From here we can do <code>npm update</code>, it will update all the dependencies to the latest version, but this is not always the best option because it can break your codebase, so you need to be careful, it's much better to update packages one by one and check if everything is working as expected by running your tests, especially with major versions.</p>\n<p>Another task to do is to check how many vulnerabilities you have in your dependencies, easy to do by running <code>npm audit</code>, this will show you the vulnerabilities and the severity of outdated packages.</p>\n<p>And while this tools are good <em>npm-check</em> does a better job combining and improving them.</p>\n<h2>A better way</h2>\n<p>There are some tools that can help you with this task, one of them is <a href=\"https://www.npmjs.com/package/npm-check\">npm-check</a>.</p>\n<p>The command <code>npx npm-check -u -E</code> will show an interactive list indicating the scope (<em>patch</em>, <em>minor</em>, <em>major</em>) of a newer version and a link to the changelog, so you can see what has changed and if it's worth updating it.</p>\n<p>It makes incredibly easy to install each dependency once at a time to avoid breaking changes. My advice here is to always run the tests after installing any major version.</p>\n<p></p>\n<h2>Workflow</h2>\n<p>For maintenance tasks, I like to reserve some time on Fridays to do this kind of work, so I can end the week with a clean slate, and I can also use this time to learn new things.</p>\n<p>I usually go through all the new dependencies and read the changelog, if I see something interesting, I update it, or make notes for future improvements based on the new features.</p>\n<h2>Problems with alternatives</h2>\n<p>In my opinion, Dependabot feels more like spam than a useful tool; it create's a lot of PRs that are most often ignored, creating a lot of noise in your repository while not helping you understand what's going on with the new versions.</p>\n<h2>Conclusion</h2>\n<p>Both your colleagues and future self will be thankful for your work on this task and the new knowledge you'll gain.</p>\n<p>Take the time to appreciate and maintain the foundation that your projects are built upon.</p>\n","tags":["dependencies","update","npm","javascript","devops","maintenance"]},{"id":"https://dobla.do/blog/choosing-a-game-engine/","title":"Choosing a game engine","url":"https://dobla.do/blog/choosing-a-game-engine/","summary":"Moving from canvas to game engines like Godot or Defold","date_published":"2023-09-18T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>With the recent <a href=\"https://news.ycombinator.com/item?id=37486431\">controversy about Unity</a>, I see more and more posts about <a href=\"/tags/gamedev\">gamedev</a>, which is a very interesting topic that I don't usually work as much as I want; I only made small games with <a href=\"https://phaser.io/\">Phaser.js</a> long ago and recently some experiments directly in <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API\">canvas</a>.</p>\n<p><a href=\"https://cocoamoss.com/\">Cocoa Moss</a> a team of two people that makes really cozy games, motivated me to give gamedev another try. I have been playing their games with my girlfriend for the past week almost every night, and they always make us happy.</p>\n<h2>Problems with canvas and not using a framework</h2>\n<p>My last game required hundreds of elements on the the screen moving and colliding with each other. canvas is very limited in this sense, and while it works, the performance is not the best. I also have to handle quirks like different density screens and other visual glitches.</p>\n<p>I need to port the game to something faster, like <a href=\"https://en.wikipedia.org/wiki/WebGL\">WebGL</a>. The problem is that WebGL by itself is a very low-level API, and I don't want to write a game engine from scratch (neither I'm smart enough to do so)</p>\n<p>Most people will opt to use a framework to handle the complexity of WebGL, the first option is usually <a href=\"https://threejs.org/\">three.js</a>. In my case, the games are not 3D, so <em>three.js</em> feels overkill.</p>\n<p>My second option was <a href=\"https://pixijs.com/\">pixi.js</a> while I'm getting somewhere, I don't like so much how the API is structured. I find myself often searching for solutions online to do basic stuff, most of the time finding code for old versions that is not compatible with the current one. This is the same reason I stopped using <em>Phaser</em>, all examples have a mix of old and new APIs, which makes it very frustrating to attempt any changes.</p>\n<p>So far, Pixi.js is my best option, but I'm still not happy with it.</p>\n<h2>Using game engines</h2>\n<p>The main reason for using a game engine is that it will handle all the complexity across many platforms, not limiting me to just the web, although that's my main target. But hey, more performance is always good, and if I do free games, I want people to be able to download them and keep them forever, or for at least longer than the time I host them.</p>\n<p>I never paid much attention to <em>Unity</em>, and after all the controversy with the fees,  many developers are moving on to other alternatives, the main ones seem to be <a href=\"https://godotengine.org/\">Godot</a> or <a href=\"https://www.unrealengine.com/\">Unreal Engine</a>. Unreal is probably overkill for what I want to do and not suitable for 2D, so my first choice was Godot.</p>\n<h2>Godot</h2>\n<p>This means that Godot is on the table. I avoided it at first because I'm the most comfortable writing <a href=\"/tags/javascript\">JavaScript</a>, and last time I checked, the developers were in the process of releasing version 4 with a huge rewrite of the engine, so I decided to wait.</p>\n<p>There are two options for writing the code: GDScript and C#. After watching many videos about the advantages of one over the other, it seems that GDScript will emerge as the winner, so I will go with that.</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=S2tTEPHIS1I\">C# Is Better Than GDScript But</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=xM-HL0RU_ho\">How Much Faster Is C# Compared to GDscript?</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=ZF-IunpetMg\">GDScript vs. C# - Which Is Better? </a></li>\n<li><a href=\"https://www.youtube.com/watch?v=g19dUmKTAfI\">C# or GDScript with Godot ?? Why Bother?</a></li>\n</ul>\n<p>Writing GDScript seems simple enough; it has basically the same syntax as Python, and it brings deep integration with the IDE.</p>\n<p>While Godot seems to be great for making games, the situation of making web games is problematic at the moment because it does not support macOS web export. This is a problem when I'm planning on mainly making web games.</p>\n<ul>\n<li><a href=\"https://github.com/godotengine/godot/issues/67949\">All HTML5 exports crash on loading</a></li>\n<li><a href=\"https://github.com/godotengine/godot/issues/70691\">HTML5 export for Godot 4.0 takes 1-2 minutes to load on macOS</a></li>\n<li><a href=\"https://www.reddit.com/r/godot/comments/141l9bm/how_far_is_godot_4_from_getting_stable_web_export/\">How far is Godot 4 from getting stable web export?</a></li>\n</ul>\n<h2>Defold</h2>\n<p>When searching for new engines, I stumbled into <a href=\"https://defold.com/\">Defold</a>.</p>\n<p>I had never heard of it before, but; I'm very surprised. The engine is open source, free, and the export is very straightforward supporting almost every platform, including macOS, Windows, Linux, Android, iOS, HTML5, consoles, etc.</p>\n<p>It uses <a href=\"https://www.lua.org/\">Lua</a> which I never wrote before, but I kinda love it now, it's simpler than Python, it's clear, and the compilation time is incredible fast, if you don't believe me watch <a href=\"https://www.youtube.com/watch?v=jUuqBZwwkQw\">Lua in 100 Seconds\n</a></p>\n<p>The IDE is very well organized, I was able to create most of the logic I need for my game after watching a <a href=\"https://www.youtube.com/watch?v=HjJ-oDz-GcI\">couple of tutorials</a>.</p>\n<p>So far, I feel more tempted to start writing my game in <em>Defold</em> until Godot gets their web export fixed.</p>\n<p>While they promote themselves as a 2D engine, underneath it's a 3D engine, and it's <a href=\"https://twitter.com/AGulev/status/1702085104422592541\">getting better and better</a>.</p>\n<p>There are fewer tutorials for <em>Defold</em> on the wild, the official tutorials are high quality, teaching step by step, with clear goals and good results.</p>\n<h2>Alternatives</h2>\n<p>I was tempted by other approaches like <a href=\"https://www.raylib.com/\">raylib</a> specially using <a href=\"https://github.com/RobLoach/node-raylib\">node-raylib</a>, and <a href=\"https://bevyengine.org/\">Bevy</a>, but I guess it's better to bet on a bigger community and a more complete engine.</p>\n<h2>Conclusion</h2>\n<p>There are many ways to make games, and betting on open source should be the way to go, especially when game developers tend to be very talented people who are willing to collaborate on making a better engine.</p>\n<p>Using a game engine brings many advantages. For me, having a community of people creating learning content is the greatest advantage, I can focus on making the game and not the engine, and I can export to many platforms.</p>\n<p></p>\n","tags":["godot","gamedev","defold","unity","canvas","webgl","lua","games","phaser","javascript","pixi","threejs","unreal","raylib","bevy"]},{"id":"https://dobla.do/blog/writing-browser-extensions-without-compiling/","title":"Writing browser extensions without compiling","url":"https://dobla.do/blog/writing-browser-extensions-without-compiling/","summary":"Positive development changes for one of my extensions.","date_published":"2021-06-24T00:00:00.000Z","content_html":"<h2>Complexity is the enemy</h2>\n<p>Recently one of my most popular <a href=\"https://github.com/dobladov/youtube2Anki\">extensions</a> received a full refactor, previously it was made with just pure JavaScript; this was fine since at the beginning it was a proof of concept, it means no complex bundles, frameworks, compilers, ...</p>\n<p>But with complexity comes necessity, managing the state of the connection between the extension and Anki and editing the sentences got complicated using imperative logic; It's amazing how used I became to declarative logic with <a href=\"https://reactjs.org/\">React</a> and this is something that I was missing for this extension.</p>\n<p>I could use React, the problem is that if the extension needs to be compiled, the review in the extensions stores will be more exhaustive, taking more time and making it longer to fix simple stuff like bugs.</p>\n<p>So in order to build trust and avoid wasting reviewer's time, all the code needed to stay just as it was written.</p>\n<p>Tools like <a href=\"https://www.snowpack.dev/\">snowpack</a> made me realize that with the advance of JavaScript modules, we might not need to compile what it's an interpreted language, seriously how did we reach this point.</p>\n<h2>Coming with simpler solutions</h2>\n<p>Let's look at the requirements, I wanted to use components, separate my logic from styles, use declarative logic, not set up any bundler (webpack, parcel, etc...) for this React would not make the cut since JSX needs some tooling and care.</p>\n<p>So the decision went to <a href=\"https://skruv.io/\">Skruv</a>, this framework is amazing, not only is tiny, modular and simple to learn, the docs are amazing well organized and clear, covering all functionality without extras.</p>\n<p>You can tell how nice the framework is by looking at this framework's goals:</p>\n<ul>\n<li>No build time or runtime dependencies, no parsers</li>\n<li>Pretty small:\n<ul>\n<li>~350 LOC vDOM</li>\n<li>~100 LOC State management</li>\n<li>~300 LOC HTML/SVG helpers</li>\n</ul>\n</li>\n<li>Useable without bundling/compilation/transpilation</li>\n<li>Fast enough for most normal use cases: <a href=\"https://krausest.github.io/js-framework-benchmark/2023/table_chrome_116.0.5845.82.html\">benchmark</a></li>\n<li>Supports async components like <code>import()</code> and <code>async</code> generators</li>\n<li>CSS scoping via shadow DOM</li>\n<li>Hopefully grokable/understandable code</li>\n</ul>\n<p>The best part is that to use it I just have to import the files, that's it.</p>\n<pre><code>import { div } from \"./skruv/html.js\";\nimport { renderNode } from \"./skruv/vDOM.js\";\n\nlet root = document.querySelector(\"#root\");\n\nroot = renderNode(div({}, \"Hello world!\"), root);\n</code></pre>\n<p>On top of those advantages, I love the nested syntax, far shorter than JSX, now that I think about it feels weird that we moved to write HTML in JS.</p>\n<p>You might be also wondering, \"what if I need typescript, do you have to transpile?\" the answer is no, you can use <a href=\"https://www.typescriptlang.org/docs/handbook/jsdoc-supported-types.html\">JSDocs with Typescript</a> without having to create a single <code>ts</code> file.</p>\n<h2>How it ended</h2>\n<p>I feel this change was a success, new code can be iterated easily without having to worry much about state or building, since the extension runs on modern browsers I don't have to care about babel, etc</p>\n<p>Right now the only concern I have about the extension is <em>manifest v3</em> which is not supported in Firefox yet, but this is a story for another post.</p>\n<p>I have to say that I'm glad about the feedback people gave, this refactor was motivated because changes on Youtube made it fail and people reported issues with a lot of support, not only that, but I've seen articles written in Vietnamese, Japanese and German in how to use the extension and how they find it useful, it really makes me want to keep contributing free, anti-traking open-source code.</p>\n","tags":["javascript","extensions","tooling","framework","firefox","chrome","manifest"]},{"id":"https://dobla.do/blog/how-to-configure-a-4k-screen-in-linux/","title":"How to configure a 4k screen in Linux","url":"https://dobla.do/blog/how-to-configure-a-4k-screen-in-linux/","summary":"Troubles with your screen?, here is how to fix it.","date_published":"2020-04-18T00:00:00.000Z","content_html":"<p>You just got a new cool 4K monitor, you opened it, connected it to your Linux device and the first thing you face is that you can't select the maximum resolution for the screen.</p>\n<blockquote>\n<p>My disappointment is immeasurable and my day is ruined. --Reviewbrah</p>\n</blockquote>\n<h2>Why is this problem happening?</h2>\n<p>Apparently some screens might not give the correct <a href=\"https://en.wikipedia.org/wiki/Extended_Display_Identification_Data\">EDID</a> information, in my case a <a href=\"https://www.samsung.com/us/business/support/owners/product/ue850-series-u28e850r/\">SAMSUNG LU28E85KRS</a>, this makes it impossible to select all supported modes for our screen, showing some default ones, without including resolutions greater than 1920x1080.</p>\n<h2>How to get the correct EDID and set it using xrandr</h2>\n<h3>Getting the correct EDID</h3>\n<p>Thanks to this wonderful answer <a href=\"https://unix.stackexchange.com/a/323121\">How to get EDID for a single monitor?</a> by <a href=\"https://unix.stackexchange.com/users/32896/malat\">Malat</a>, obtaining the correct information is easy.</p>\n<pre><code>sudo apt install read-edid\nsudo get-edid | parse-edid\n</code></pre>\n<p>Cool, we get all supported modes.</p>\n<pre><code>Modeline    \"Mode 1\" 148.500 1920 2008 2052 2200 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 0\" 297.00 3840 4016 4104 4400 2160 2168 2178 2250 +hsync +vsync\nModeline    \"Mode 2\" 74.250 1280 1390 1420 1650 720 725 730 750 +hsync +vsync\nModeline    \"Mode 3\" 148.500 1920 2448 2492 2640 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 4\" 74.250 1280 1720 1760 1980 720 725 730 750 +hsync +vsync\nModeline    \"Mode 5\" 27.027 720 736 798 858 480 489 495 525 -hsync -vsync\nModeline    \"Mode 6\" 27.000 720 732 796 864 576 581 586 625 -hsync -vsync\nModeline    \"Mode 7\" 74.250 1920 2558 2602 2750 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 8\" 74.250 1920 2008 2052 2200 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 9\" 148.50 1920 2008 2052 2200 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 10\" 148.50 1920 2448 2492 2640 1080 1084 1089 1125 +hsync +vsync\nModeline    \"Mode 11\" 74.25 1280 1390 1430 1650 720 725 730 750 +hsync +vsync\nModeline    \"Mode 12\" 241.50 2560 2608 2640 2720 1440 1443 1448 1481 +hsync -vsync\n</code></pre>\n<h3>Adding the new modes with xrandr</h3>\n<p>The first value after the mode number tell us the horizontal resolution, in my case I'm interested in <code>Mode 0</code>.</p>\n<pre><code>Modeline    \"Mode 0\" 297.00 3840 4016 4104 4400 2160 2168 2178 2250 +hsync +vsync\n</code></pre>\n<p>Let's create a new mode, we can name it anything we want, but I prefer to name it after the output resolution.</p>\n<pre><code>xrandr --newmode \"3840x2160\" 297.00 3840 4016 4104 4400 2160 2168 2178 2250 +hsync +\n</code></pre>\n<p>Now we add the mode to the output, if you are not sure which one is the output, run <code>xrandr</code> and it will show something like <code>HDMI-2 connected</code>.</p>\n<p>We use the name of the output.</p>\n<pre><code>xrandr --addmode HDMI-2 3840x2160\n</code></pre>\n<p>Now the new resolution should be available in the Display settings.</p>\n<p>Don't forget to set font DPI and screen scale to you taste.</p>\n<h2>Useful information</h2>\n<ul>\n<li><a href=\"https://wiki.archlinux.org/index.php/Xrandr\">Arch wiki xrandr</a></li>\n<li><a href=\"https://gist.github.com/datagrok/410d26e24ec51159cdfd2a400b809705\">Automate setting the screen</a></li>\n</ul>\n","tags":["4k","screen","Xrandr","KDE"]},{"id":"https://dobla.do/blog/crawling-data-from-dynamically-generated-sites/","title":"Crawling data from dynamically generated sites","url":"https://dobla.do/blog/crawling-data-from-dynamically-generated-sites/","summary":"How to get data from other sites using free online services","date_published":"2020-02-14T00:00:00.000Z","content_html":"<p>Let's start with the need, why I had the necessity to do this,\nRecently I created this <a href=\"https://observablehq.com/@dobladov/coronavirus-2019-ncov\">Corona Virus Map</a>, I wanted to be the fastest getting the data from the source site in Chinese, most of the other sites get the data periodical using a cron task and dumping their data locally.</p>\n<p>In my case I wanted to get their data every time the map is loaded, ensuring more accurate results and completely avoiding any manual update of data.</p>\n<h2>Parsing the site</h2>\n<p>So my first try was to curl the page and sadly the results for this <a href=\"https://ncov.dxy.cn/ncovh5/view/pneumonia\">site</a> will not load unless you use Javascript since the tables are dynamically generated.</p>\n<p>This leave us with not many options but to use a browser, so in my case I decided to use Puppeteer, a headless Chrome browser to get the data.</p>\n<p>So after a while playing with it I got the code to do it, it will download and log the data in the format that I need.</p>\n<pre><code>const fs = require(\"fs\");\nconst puppeteer = require(\"puppeteer\");\n\n(async () =&gt; {\n  const browser = await puppeteer.launch();\n  const page = await browser.newPage();\n  await page.goto(\"https://ncov.dxy.cn/ncovh5/view/pneumonia\");\n  const data = await page.evaluate((body) =&gt; {\n    [...document.querySelectorAll(\".close___2yTiY:not(.open___3it7L)\")].forEach(\n      (e) =&gt; e.click(),\n    );\n    return [\n      ...document\n        .querySelectorAll(\".areaBox___3jZkr\")[1]\n        .querySelectorAll(\".areaBlock2___27vn7\"),\n    ].map((row) =&gt; {\n      const [area, , confirmed, dead, cured] = [...row.querySelectorAll(\"p\")];\n      return {\n        area: area.innerText,\n        confirmed: +confirmed.innerText || 0,\n        dead: +dead.innerText || 0,\n        cured: +cured.innerText || 0,\n      };\n    });\n  });\n  console.log(data);\n  fs.writeFileSync(\n    `2020-02-16T21:21:26.466Z.json`,\n    JSON.stringify(data, null, 2),\n  );\n  await browser.close();\n})();\n</code></pre>\n<p>After launching this script with <code>node crawler.js</code> I get a file that I can use as the source data of my visualization.</p>\n<p>All fine but now I have another need, how to get this data every time I load the map?</p>\n<p>For this I definitely need a server running but for this case I wanted to see what can I do with free services.</p>\n<h2>Using Glitch</h2>\n<p>My first approach was to use <a href=\"glitch.com\">Glitch</a>, after setting a express server and a few tries later I got my data every time I curl this url: https://coronacrawler.glitch.me</p>\n<pre><code>const express = require(\"express\");\nconst app = express();\nconst puppeteer = require(\"puppeteer\");\n\napp.use(express.static(\"public\"));\n\napp.get(\"/\", async function (request, response) {\n  try {\n    const browser = await puppeteer.launch({\n      args: [\"--no-sandbox\"],\n    });\n\n    // Same code to get the data before\n\n    res.json(data);\n  } catch (error) {\n    console.log(error);\n  }\n});\n\nconst listener = app.listen(process.env.PORT, function () {\n  console.log(\"Your app is listening on port \" + listener.address().port);\n});\n</code></pre>\n<p>Cool, but this creates another problem.</p>\n<h3>Cross-origin</h3>\n<p>The map running in ObservableHQ needs to crawl this data and unfortunately if you curl a different domain from a website it needs to have Cross-origin headers enabled or for security reasons it will not load, after adding this to our express server it works.</p>\n<pre><code>app.use(function (req, res, next) {\n  res.header(\"Access-Control-Allow-Origin\", \"*\");\n  res.header(\n    \"Access-Control-Allow-Headers\",\n    \"Origin, X-Requested-With, Content-Type, Accept\",\n  );\n  next();\n});\n</code></pre>\n<h4>Alternative to Cross-origin</h4>\n<p>Another solution if adding the headers is impossible (For example in a server we can't control), we can use a service like <a href=\"https://cors-anywhere.herokuapp.com/\">cors-anywhere</a>, just changing the URL to be:</p>\n<pre><code>https://cors-anywhere.herokuapp.com/https://coronacrawler.glitch.me\n</code></pre>\n<h4>Problems with Glitch</h4>\n<p>Nice, now I have a server running and I can query the data, what else can I ask for? Well while this works there are two main problems, Glitch is more of a place for playing with code and experimenting so it will not be fast.</p>\n<p>Glitch servers go to sleep, it's perfectly understandable, it makes no sense for Glitch to give computing power for free running all the time, after some period of inactivity the machine will go to sleep and it needs to be awaken the next time, this makes the map unresponsive if there are not many queries and it gives the sensation of being more slow than it is.</p>\n<p>At this point I moved to zeit.co</p>\n<h2>Using Zeit.co</h2>\n<p>Why use zeit.co when Glitch is working?</p>\n<p>This service offers quite a nice free \"Hobby\" service allowing to use serverless functions.</p>\n<h3>Creating a serverless function</h3>\n<p>We need to modify the previous script a little since we have other constrains.</p>\n<p>First we need a start point for the api query in this case we need a file in <code>/api/index.js</code></p>\n<pre><code>const getData = require(\"./getData\");\n\nmodule.exports = async (req, res) =&gt; {\n  const data = await getData();\n  res.json(data);\n};\n</code></pre>\n<p>The first problem I encountered is that using puppeteer is a little bit different, luckily this guide <a href=\"https://zeit.co/blog/serverless-chrome\">Serverless Chrome via Puppeteer with Now 2.0</a> explains how to do it well.</p>\n<pre><code>const chrome = require(\"chrome-aws-lambda\");\nconst puppeteer = require(\"puppeteer-core\");\n\nconst getData = async () =&gt; {\n  const browser = await puppeteer.launch({\n    args: chrome.args,\n    executablePath: await chrome.executablePath,\n    headless: chrome.headless,\n  });\n\n  const page = await browser.newPage();\n  await page.goto(\"https://ncov.dxy.cn/ncovh5/view/pneumonia\");\n\n  // Same code to get the data before\n\n  return data;\n};\n\nmodule.exports = getData;\n</code></pre>\n<h4>Supporting Cross-origin</h4>\n<p>To enable cors we need a file <code>/api/200.js</code></p>\n<pre><code>module.exports = async (req, res) =&gt; {\n  res.status(200).send({ message: \"cors ok\" });\n};\n</code></pre>\n<p>Also our <code>now.js</code> file should look like this.</p>\n<pre><code>{\n  \"version\": 2,\n  \"routes\": [\n    {\n      \"src\": \"/(.*)\",\n      \"dest\": \"/api/index.js\",\n      \"headers\": {\n        \"Access-Control-Allow-Origin\": \"*\",\n        \"Access-Control-Allow-Methods\": \"OPTIONS\",\n        \"Access-Control-Allow-Headers\": \"Origin, X-Requested-With, Content-Type, Accept, Authorization\"\n      }\n    }\n  ]\n}\n</code></pre>\n<p>After this using the command <code>now</code> should upload the project to zeit.co and the data is available on the project url https://cvirus.dobladov.now.sh/</p>\n<h2>Notes</h2>\n<p>As an alternative to Glitch and Zeit we can use <a href=\"https://docs.netlify.com/functions/overview/#manage-your-serverless-functions\">Netlify</a>, but for this project it was not necessary.</p>\n<p>I'm not affiliated to Glitch of Zeit.co in any way, I just think both are really nice services to run my apps.</p>\n","tags":["javascript","crawler"]},{"id":"https://dobla.do/blog/automatically-deploy-to-github-pages-using-actions/","title":"Automatically deploy to GitHub Pages using Actions","url":"https://dobla.do/blog/automatically-deploy-to-github-pages-using-actions/","summary":"How to automate your workflows increasing your productivity and reducing manual errors.","date_published":"2020-02-07T00:00:00.000Z","content_html":"<p></p>\n<p>This has become the main way to deploy most of my projects and it has greatly reduced the time invested doing it by hand, also avoiding headaches that you might be familiar with like, \"ohhh! I forgot to checkout the proper branch\", \"I used the wrong script.\", \"I accidentally deleted the database and all the backups while updating a CSS color\".</p>\n<p>After setting up this workflow your code will be automatically deployed after each commit to master without human interaction and without having to use other service than GitHub.</p>\n<blockquote>\n<p>“There should be two tasks for a human being to perform to deploy software into a development, test, or production environment: to pick the version and environment and to press the “deploy” button.”\n― David Farley, Continuous Delivery: Reliable Software Releases through Build, Test, and Deployment Automation</p>\n</blockquote>\n<h2>Advantages</h2>\n<p>If just mentioning the world <em>\"Automatically\"</em> does not catch your attention, these are some of the main reasons why is worth to write some tiny workflows.</p>\n<h3>Single source of truth</h3>\n<p>Your code and and scrips for deployment are on same repository ensuring that all the information to create a build is on the repository and no manual process or tool is missing.</p>\n<h3>Documentation of deployments</h3>\n<p>The <code>.yml</code> workflow shows how to do a proper deployment, other developers should know how it can be replicated locally; Even if there are no comments it might be easy to reverse engineer this files.</p>\n<h3>Automated testing</h3>\n<p>Before each build tests can be enforce to avoid putting code on production that might contain errors or not follow the code style guide.</p>\n<h3>No more manual tasks</h3>\n<p>This is clear, automating a process is always faster and in general less error prone than putting your code manually in production on a Friday before vacations.</p>\n<h3>Multi-platform</h3>\n<p>Multiple platforms can be tested while doing the deployment without the need of the developers of installing virtual machines.</p>\n<h3>Cost</h3>\n<p>Manual deployment will cost you at the very least time, GitHub actions are for free both in price and your time, why not use them?</p>\n<h2>Creating a new Action</h2>\n<p>Choose a repository, go to Actions and add new one.</p>\n<p>We need to create a new file, in this case is called <code>deploy.yml</code>, here we will define the process for the deployment, make sure to <strong>never put any secrets in here</strong> since it will be committed to the repository.</p>\n<p>The structure goes this way, we need a <code>name</code>, <code>on</code> which circumstances we need to run this action, and which <code>jobs</code> the action will execute.</p>\n<pre><code>name: Deploy to GitHub Pages\n\non:\n  push:\n    branches:\n      - master\n\njobs:\n  build-and-deploy:\n    runs-on: ubuntu-latest\n\n    steps:\n      - name: Checkout\n        uses: actions/checkout@v4\n\n      - name: Build\n        uses: actions/setup-node@v4\n        with:\n          node-version: \"22.x\"\n      - run: |\n          npm install\n          npm test\n          npm run build\n          touch dist/.nojekyll\n          echo \"snoo.odyssey.codes\" &gt; dist/CNAME\n      - name: Deploy\n        uses: JamesIves/github-pages-deploy-action@releases/v3\n        with:\n          GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}\n          BRANCH: gh-pages\n          FOLDER: dist\n</code></pre>\n<p>After saving this new workflow we should have a file called <code>deploy.yml</code> inside <code>.github/workflows</code>.</p>\n<p>Immediately a new action will be triggered executing the workflow, making a new build and pushing it to the <code>gh-pages</code> branch.</p>\n<p>After is finish our app should be available at the repository public URL, the URL is show in Setting -&gt; GitHub Pages, here you can also set a custom one.</p>\n<h3>Functionality of each block</h3>\n<p>Let's go trough each part of the code.</p>\n<p>Here we are indicating push code to master should trigger this Action.</p>\n<pre><code>on:\n  push:\n    branches:\n      - master\n</code></pre>\n<p>Inside of jobs we have to define the machine that will run the code, in this case Ubuntu.</p>\n<pre><code>build-and-deploy:\n\truns-on: ubuntu-latest\n</code></pre>\n<h4>Steps of the job</h4>\n<p>The Action is now divided in different <code>steps</code> that will be executed sequentially.</p>\n<p>This step will checkout your repository to make the code available.</p>\n<pre><code>- name: Checkout\n  uses: actions/checkout@v4\n</code></pre>\n<p>Now we set node.js and we use version 13 to run the code, I would recommend to read the docs to do some other interesting stuff like running multiple node versions.</p>\n<p>This step will be similar for other code like go or rust</p>\n<pre><code>- name: Build\n  uses: actions/setup-node@v4\n  with:\n    node-version: \"22.x\"\n</code></pre>\n<p>The interesting part, here we have to define the process of actually building the site in this case something similar to what we would execute on our local machine to do it.</p>\n<p>In this case I install the missing node packages, test the code and compile the site.</p>\n<p>After this I added some special stuff for this repository, for example I make sure to create a file indicating that is not a Jekyll repository but this is actually not required in most cases.</p>\n<p>After that I define the CNAME since I want this code to run on a custom domain instead of <code>user.github.io/repository</code></p>\n<pre><code>- run: |\n  npm install\n  npm test\n  npm run build\n  touch dist/.nojekyll\n  echo \"snoo.odyssey.codes\" &gt; dist/CNAME\n</code></pre>\n<p>With this last step we push the code to the <code>gh-pages</code> branch of the repository</p>\n<pre><code>- name: Deploy\n      uses: JamesIves/github-pages-deploy-action@releases/v3\n      with:\n        GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}\n        BRANCH: gh-pages\n        FOLDER: dist\n</code></pre>\n<p>If any of this steps fails the process will stop ensuring no \"bad build\" will be out on production.</p>\n<h2>More about it</h2>\n<h3>Committing the build to a different repository</h3>\n<p>I had the use case of having to push the build to a different repository from the one where the sources are.</p>\n<p>In this case I wanted to have the code of my blog on a repository and deploy this build to a GitHubs's special repository named name.github.io, to serve my personal page from here since 'gh-pages' does not work for this repository and my blog does not use Jekyll meaning the source code has to be on a separated repository and the build on master.</p>\n<p>To create this token go to <code>Settings</code> -&gt; <code>Developer settings</code> -&gt; <code>Personal access tokens</code> and create a new one.</p>\n<p>With this configuration, we can use a personal token that needs to be set on Settings -&gt; Secrets, since the <code>secrets.GITHUB_TOKEN</code> only allows you to commit to your current repository.</p>\n<pre><code>- name: Deploy\n      uses: peaceiris/actions-gh-pages@v4\n      with:\n        personal_token: ${{ secrets.PERSONAL_TOKEN }}\n        external_repository: dobladov/dobladov.github.io\n        publish_branch: master\n        publish_dir: ./dist\n\n</code></pre>\n<h3>Testing multiple platforms</h3>\n<p>Different platforms might use different commands.</p>\n<p>For example let's say there's a <code>rm</code> in the scripts of the package.js while this build should work on MacOS and Linux, unfortunately it will fail on Windows since the <code>rm</code> command is not available, with a multiple platform test we will realize that using a solution like <code>rimraf</code> instead of <code>rm</code> will solve the problem for Windows.</p>\n<pre><code>strategy:\n      matrix:\n        platform: [ubuntu-latest, macos-latest, windows-latest]\n    runs-on: ${{ matrix.platform }}\n</code></pre>\n<h3>Writing a CNAME for custom domains</h3>\n<p>If your deployments needs a custom domain don't forget to write this file on each build.</p>\n<pre><code>echo \"snoo.odyssey.codes\" &gt; dist/CNAME\n</code></pre>\n<h3>Running actions on other events</h3>\n<p>Actions are not limited to push to master, is possible to also execute test or do other task on pull request or any kind of supported action, also to schedule this tasks using cron.</p>\n<pre><code>on:\n  schedule:\n    - cron: \"0 * * * *\"\n</code></pre>\n<h3>Not only for deployments</h3>\n<p>Actions can be used for creating new release packages, also notifications, emails can be send on each event, the limit is your imagination.</p>\n<h3>Disadvantages</h3>\n<p>One of the main disadvantages, is that like any other service if is down you will not be able of deploying using these workflows, It does not limit you to still do manual deployments for your application.</p>\n<p>If you wonder why your perfectly working action does not work don't forget to check: https://status.github.com/</p>\n<p>Actions are not a 100% reliable if the infrastructure of GitHub fails, I had a problem where GitHub did not trigger one of my builds when I merged new code, a way to force a new commit without changes is to execute <code>git commit --allow-empty</code>, this will cause the action to be executed.</p>\n<h2>Documentation</h2>\n<p>Documentation worth reading:</p>\n<ul>\n<li><a href=\"https://github.com/actions/setup-node\">Node Action documentation</a></li>\n<li><a href=\"https://github.com/JamesIves/github-pages-deploy-action\">Deploy Action documentation</a></li>\n<li><a href=\"https://help.github.com/en/actions/automating-your-workflow-with-github-actions\">GitHub Actions documentation</a></li>\n<li><a href=\"https://github.com/actions/checkout\">Checkout Action documentation</a></li>\n</ul>\n<p>Some examples of my GitHub Actions:</p>\n<ul>\n<li><a href=\"https://github.com/dobladov/snoo/blob/master/.github/workflows/deploy.yml\">Snoo</a></li>\n<li><a href=\"https://github.com/dobladov/last-time/blob/master/.github/workflows/deploy.yml\">Last-Time</a></li>\n<li><a href=\"https://github.com/dobladov/mdx-blog/blob/master/.github/workflows/deploy.yml\">This blog</a></li>\n</ul>\n","tags":["GitHub","devops","production","gh-pages"]},{"id":"https://dobla.do/blog/git-tricks/","title":"Git tricks","url":"https://dobla.do/blog/git-tricks/","summary":"Some of my tweaks for using git more efficiently","date_published":"2023-08-22T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p><a href=\"https://git-scm.com/\">Git</a> is one of my most used work tools, sharpening our tools helps us be more productive and save a lot of time. These are some of my tweaks to speed up my workflow when interacting with git.</p>\n<h2>ZSH git aliases</h2>\n<p>One of the first things I do after setting up my laptop is to install <a href=\"https://www.zsh.org/\">ZSH</a> and <a href=\"https://ohmyz.sh/\">Oh My ZSH</a>.</p>\n<p>Their <a href=\"https://kapeli.com/cheat_sheets/Oh-My-Zsh_Git.docset/Contents/Resources/Documents/index\">aliases</a> have become completely natural to me, and I can't work without them.</p>\n<p>While the list looks a bit overwhelming, it's actually very easy to remember them; most of the time it's the initial letter or how you would pronounce them, for example <code>git checkout</code> becomes <code>gco</code>.</p>\n<p>After a few uses, they become natural, and you will find yourself using them without thinking about it.</p>\n<p>These are my most used shortcuts:</p>\n<ul>\n<li><code>git fetch</code> -&gt; <code>gf</code></li>\n<li><code>git add</code> -&gt; <code>ga</code></li>\n<li><code>git commit -m</code> -&gt; <code>gcmsg</code></li>\n<li><code>git checkout</code> -&gt; <code>gco</code></li>\n<li><code>git checkout -b</code> -&gt; <code>gcb</code></li>\n<li><code>git merge</code> -&gt; <code>gm</code></li>\n<li><code>git pull origin \"$(git_current_branch)</code> -&gt; <code>ggpull</code></li>\n<li><code>git push origin \"$(git_current_branch)\"</code> -&gt; <code>ggpush</code></li>\n</ul>\n<p>Commands that include variables like <code>git_current_branch</code> save a huge amount of time and mental attention.</p>\n<h2>Custom aliases</h2>\n<p>Switching between my latest edited branches is common, and this command helps me quickly visualize my modified branches in order.</p>\n<pre><code>alias branchOrder='git branch --sort=-committerdate'\n</code></pre>\n<p>Similar to the last command, it helps to switch branches in a quick way using <a href=\"https://github.com/junegunn/fzf\">fuzzy finder</a>.</p>\n<pre><code>alias gcoi='git checkout $(git branch -a | fzf | xargs)'\n</code></pre>\n<p>For one of my projects, we include the PR number on the <a href=\"https://keepachangelog.com/\">Changelog</a>, this command gives me the value without having to open the browser.</p>\n<pre><code>alias lastPR='gh pr list -s all --json number --jq \".|=sort_by(.number)|last|.n&gt;\n</code></pre>\n<h2>Global git ignore</h2>\n<p>I like to keep a global gitignore file, this is useful for ignoring files that are not specific to a project, for example, IDE configuration files.</p>\n<p>Adding <code>devNotes*</code> is especially useful as it helps me to write notes about a project while being sure they won't be pushed by accident to the repository.</p>\n<pre><code>nano .gitignore_global\ngit config --global core.excludesfile ~/.gitignore_globa\n</code></pre>\n<pre><code>.DS_Store\n.vscode\ndevNotes*\ndev-notes*\n</code></pre>\n<h2>ZSH theme</h2>\n<p>ZSH themes are very customizable, I like to keep it simple, my current one is basically the default one with a few tweaks, a simpler way to display the <strong>branch name</strong> on the left side and the <strong>SHA commit</strong> on the right, content on the <code>RPROMPT</code> will be automatically hidden if the content goes over it.</p>\n<p>That information helps me understand what I'm working at a glance, avoiding the need to run <code>git status</code> or <code>git branch</code> to get that information.</p>\n<p></p>\n<pre><code>PROMPT=\"%(?:%{$fg_bold[green]%}➜ :%{$fg_bold[red]%}➜ )\"\nPROMPT+=' %{$fg[cyan]%}%c%{$reset_color%} $(git_prompt_info)'\nRPROMPT='%F{cyan}$(git_prompt_short_sha)%F{reset}'\nZSH_THEME_GIT_PROMPT_PREFIX=\"%{$fg_bold[blue]%}(%{$fg[red]%}\"\nZSH_THEME_GIT_PROMPT_SUFFIX=\"%{$reset_color%} \"\nZSH_THEME_GIT_PROMPT_DIRTY=\"%{$fg[blue]%}) %{$fg[yellow]%}✗\"\nZSH_THEME_GIT_PROMPT_CLEAN=\"%{$fg[blue]%})\"\n</code></pre>\n<h2>Gh command</h2>\n<p>This section is more suited to GitHub than git but since my workflow combines both, I think it's worth mentioning.</p>\n<p>I use <a href=\"https://cli.github.com/\">GitHub CLI</a> mostly for scripting, there are two very simple commands that save me a lot of time, <code>gh repo view -w</code> and <code>gh pr view -w</code>, they open the current repository or pull request in the browser.</p>\n<p>Another command that I like to execute is <code>gh run watch</code> to know when a workflow is finished, for example, when I'm running tests on a PR, it can be pipped to the command <code>say [message]</code> to get a notification when the workflow is finished.</p>\n<p>There's more to this command, but these three options are really useful.</p>\n<p></p>\n","tags":["git","productivity","tools","zsh","oh-my-zsh","gh","github","gitignore","gitconfig","git-aliases"]},{"id":"https://dobla.do/blog/how-i-journal-using-foam/","title":"How I journal using Foam","url":"https://dobla.do/blog/how-i-journal-using-foam/","summary":"Reasons to use Foam and why I think it's the best note-taking workflow.","date_published":"2023-08-15T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>Note-taking helps us focus, remember and organize our thoughts, it's an incredible tool to improve your work and yourself.</p>\n<p>I've been taking notes for a long time, but I never had a good system to keep them organized and more importantly go back and read/refine old notes.</p>\n<h2>Why choosing Foam over alternatives</h2>\n<p>I stared to use <a href=\"https://foambubble.github.io/foam/\">Foam</a> to annotate everything, I had many attempts with other tools, none seemed to stick, my last attempt was <a href=\"https://www.notion.so/\">Notion</a>.</p>\n<p>While I find <em>Notion</em> incredibly useful it feels sluggish and the layout does not make me want to come back or write more, I do have a big amount of topics in there, but even when I can connect the pages, it's really hard to make mental connections to each one of the other topics.</p>\n<p>There are other issues with <em>Notion</em>, like privacy concerns, but to me the most important is ownership, it's possible to export simple notes to Markdown, but takes a lot of time and is not a good experience, I didn't check their API, in any case I'm sure it's not as easy as cloning a git repository.</p>\n<p>This is why I love <em>Foam</em>, it works the same way as as <a href=\"https://obsidian.md/\">Obsidian</a> or other <a href=\"https://en.wikipedia.org/wiki/Zettelkasten\">Zettelkasten</a> apps, but inside of <a href=\"https://code.visualstudio.com/\">VSCode</a>, this is great because I always have <em>VSCode</em> opened, meaning that I don't have to switch context, all my shortcuts and plugins work, I can use the same editor for everything.</p>\n<p>The view of the graph is the main selling point to use <em>Obsidian</em>, no more need to remember visiting old post, all is connected and can be accessed with a click, this is a game changer for me, I can see the connections between topics and ideas, I can see the evolution of my thoughts and how they are connected.</p>\n<p>A graph view is something that I always wanted to have and what makes the difference in my total number of edits, and the view in <em>Foam</em> works great, it can be positioned like any other tab which I always keep as a pinned tab with <code>cmd + k shift + enter</code>.</p>\n<p></p>\n<p>There's some sense of satisfaction after looking at all the connections on the graph that making me want to write even more.</p>\n<h2>Journaling</h2>\n<p>I make daily notes to keep track of what I did in a short resume format, it's easy to create a new document using the shortcuts like <code>/today</code>, <code>/yesterday</code> or <code>/+1w</code> all of my notes can be connected using tags to other notes, this makes easy to visualize what I was doing on a particular day with the graph view without having to search or even open the note.</p>\n<h2>Plugins system</h2>\n<p>The integrations work great, multiple plugins doing one thing and doing it well.</p>\n<p>I can integrate dynamic <a href=\"https://excalidraw.com/\">Excalidraw</a> documents, before I used to have a single <em>Excalidraw</em> page opened in my browser with a bunch of cramped ideas, now I can simply create a new <code>idea.excalidraw.png</code> and immediately work on separated contexts, I can't overstate how useful it has become.</p>\n<p>On top of it, I can directly link the <code>excalidraw.png</code> file inside Markdown and preview it while still being editable.</p>\n<p></p>\n<p>There are many other integrations, to <a href=\"https://marketplace.visualstudio.com/items?itemName=mushan.vscode-paste-image\">paste images</a>, <a href=\"https://marketplace.visualstudio.com/items?itemName=fabiospampinato.vscode-markdown-todo\">create todos</a>, <a href=\"https://marketplace.visualstudio.com/items?itemName=kisstkondoros.vscode-gutter-preview\">preview images</a> like shown in the last screenshot or simply have a <a href=\"https://marketplace.visualstudio.com/items?itemName=yzhang.markdown-all-in-one\">better markdown experience</a>.</p>\n<p>Best part is that all of these plugins are just <em>VSCode</em> plugins that have functionality outside of <em>Foam</em>, enriching your whole development experience.</p>\n<h2>Backups</h2>\n<p>The output of <em>Foam</em> is just plain text making trivial to put the content into a repository.</p>\n<p>Git once understood it's such a powerful tool that changes your way to think, for me the ability to have diffs and restore what I'm working on it's invaluable.</p>\n<p>For my normal workflow, I write my notes during the day and next day review the changes using git, make corrections and push them to the repository, this helps to refresh my memory and improve the quality of the notes.</p>\n<p>And again all of this without leaving <em>VSCode</em> and completely open source, I can't thank enough all the <a href=\"https://foambubble.github.io/foam/#thanks-and-attribution\">contributors</a>.</p>\n<p></p>\n","tags":["notes","productivity","vscode","foam","obsidian","git","markdown"]},{"id":"https://dobla.do/blog/leaving-the-loop-of-repetition/","title":"Leaving the loop of repetition","url":"https://dobla.do/blog/leaving-the-loop-of-repetition/","summary":"Breaking the loop of addiction by replacing it with something positive","date_published":"2023-08-30T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>I never had to deal with drugs, or what's seen as a \"serious\" addiction. But I believe I've been addicted to other things, like video games, endless scrolling, and other more mundane entertainment.</p>\n<p>There have been periods of time when I was aware of wasting my life in ways that made me feel bad about myself, and I don't mean feeling bad for not being a workaholic, but for really enjoying my time of reading or simply sitting in the grass looking at trees.</p>\n<h2>The Loop</h2>\n<p>The loop is a cycle of repetition. It's a habit that you can't seem to break. It's a pattern that you can't seem to escape. It's a routine that you can't change.</p>\n<p>The first step is to become aware of the loop. You have to be able to see it, and realize how it's negatively affecting your life.</p>\n<p>At some point, I came to the realization that breaking the loop can only be done one way: <strong>by replacing the addiction with something positive</strong>.</p>\n<p>Once you know what you have to get rid of, it's important to find a replacement. At this point, you have to understand that <strong>there's no stop of of the bad habit by willpower alone</strong>; the only way to get rid of it is by being busy enough with something else to the point that you don't have time to think about it.</p>\n<h2>Breaking the loop</h2>\n<p>I used to spend time on places like <a href=\"https://www.reddit.com/\">Reddit</a> doing nothing but scrolling, rarely participating in the conversation.</p>\n<p>At some point, I knew I was getting nothing from it, no fun, no growth, not even real entertainment, what I was watching was gone the moment the next piece of content came, creating nothing of value.</p>\n<p>I took many approaches, some very effective, like blocking the content in tedious ways to use it, like blocking the domain in the hosts file, and while it reduced the consumption, it was still a problem, causing me to go back to the same pattern.</p>\n<p>The only thing that worked was to completely replace it by reading. If I really want to go to <em>Reddit</em>, I always have better content prepared.</p>\n<p>I store hundreds of articles in <a href=\"https://pocket.com/\">Pocket</a> to read later, I started to <a href=\"http://localhost:3000/blog/reading-books-on-my-phone/\">read on my phone</a>. This way, I have content that really fulfills me, and I can do it anywhere, anytime, with the same convenience of scrolling <em>Reddit</em>.</p>\n<p>That was the key factor: make it as convenient as possible and make it something that I really enjoy, and that's the only way to break the loop.</p>\n<p>There are other habits that I've changed, like exercising. While I was always in shape, or at least thin, I always wanted to do more.</p>\n<p>I was able to have enough determination to run often, but it never felt good for me, it made me lose more weight than I needed, and I didn't enjoy it. I was doing it because I thought it was the only way to exercise.</p>\n<p>So it became another loop to break. I replaced it with <a href=\"https://en.wikipedia.org/wiki/Calisthenics\">calisthenics</a>, I started to do it at home, and I really enjoy it.</p>\n<p>I can do it anywhere, anytime, and for as long as I want. I can do it in a way that I enjoy and in a way that I can see progress, and that's the key factor: make it as convenient as possible and make it something enjoyable.</p>\n<p>Find your loop and replace it.</p>\n<p></p>\n","tags":["addiction","loop","repetition","habits","pattern","routine","productivity","Reddit","Pocket","calisthenics","exercise","running","reading","books","phone"]},{"id":"https://dobla.do/blog/making-the-orb/","title":"Making the Orb","url":"https://dobla.do/blog/making-the-orb/","summary":"How the interactive orb in my site was made.","date_published":"2023-08-19T00:00:00.000Z","content_html":"<p>import orbMeme from \"./orb-meme.jpg\";\nimport YoutubeVideo from \"#astro/components/YoutubeVideo.astro\";\nimport orb from \"./orb.webm\";\nimport noJsOrb from \"./orb-no-js.webm\";</p>\n<h2>Introduction</h2>\n<p>Inspired by sites like <a href=\"https://oimo.io/\">Oimo</a> I wanted to have one interactive element, ideally something that doesn't get in the way and makes the main page standout while not being too resource intense.</p>\n<p>I played with some other ideas like noise backgrounds, generating a map that constantly changes, <a href=\"https://en.wikipedia.org/wiki/Rorschach_test\">Rorschach patterns</a>, floating particles, but none of them looked good enough (I'm not a designer) or felt more special than a background.</p>\n<p>&lt;video width=\"400\" autoplay loop style={{ maxWidth: \"100%\", display: \"flex\", margin: \"0 auto\" }}&gt;\n&lt;source src={orb} type=\"video/webm\" /&gt;\n&lt;/video&gt;</p>\n<p>&lt;br /&gt;</p>\n<h2>Implementation</h2>\n<p>Then I saw this wonderful video from <a href=\"https://www.youtube.com/@BarneyCodes\">Barney Codes</a> and I loved how the flow field looked; He did a wonderful explanation and re-creating it was a breeze, a channel totally worth <a href=\"https://www.youtube.com/@BarneyCodes?sub_confirmation=1\">subscribing</a>.</p>\n<p>&lt;YoutubeVideo\nvideoId=\"sZBfLgfsvSk\"\nvideoTitle=\"Easy Perlin Noise Flow Fields\"\n/&gt;</p>\n<h2>Tweaks</h2>\n<p><a href=\"https://p5js.org/\">p5</a> can be a bit of a heavy library and it's global nature makes it not ideal for a final implementation, I ported the code to be mostly vanilla &lt;abbr title=\"JavaScript\"&gt;js&lt;/abbr&gt; with the exception of the <a href=\"https://github.com/josephg/noisejs\">perlin noise</a>, the author of the library has a good article of how it works, <a href=\"https://joeiddon.github.io/projects/javascript/perlin.html\">\"Creating perlin noise in JS\"</a>.</p>\n<p>&lt;p\nclass=\"codepen\"\ndata-height=\"300\"\ndata-theme-id=\"dark\"\ndata-default-tab=\"js,result\"\ndata-slug-hash=\"dyQBGMG\"\ndata-preview=\"true\"\ndata-user=\"dobladov\"\nstyle=\"height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\"</p>\n<blockquote></blockquote>\n<p>&lt;span&gt;\nSee the Pen\n&lt;a href=\"https://codepen.io/dobladov/pen/dyQBGMG\"&gt;\nFlow Field with chromatic aberration\n&lt;/a&gt;\nby DobladoV (&lt;a href=\"https://codepen.io/dobladov\"&gt;@dobladov&lt;/a&gt;) on\n&lt;a href=\"https://codepen.io\"&gt;CodePen&lt;/a&gt;.\n&lt;/span&gt;\n&lt;/p&gt;\n&lt;script async src=\"https://cpwebassets.codepen.io/assets/embed/ei.js\"&gt;&lt;/script&gt;</p>\n<p>One of the ideas I had in mind for the site theme was using <a href=\"https://en.wikipedia.org/wiki/Chromatic_aberration\">chromatic aberration</a> for some elements, adding it to the flow field really makes it pop just by displacing the particles in red, green and blue; At this point it looked good, but it had some problems, making it such a huge background element requires many particles, this can be an intensive task so if I could make it smaller.</p>\n<h2>Inspiration</h2>\n<p>The idea of making it an orb was inspired by this <a href=\"https://twitter.com/wiz_mud/status/1687956508531679232\">meme</a> and his wonderful game <a href=\"http://wiz.zone\">Wiz.Zone</a>, I thought using the orb and including the flow field inside would look interesting, while reducing the number of particles needed, I'm definitely pleased with the result.</p>\n<p>&lt;img\nsrc={orbMeme.src}\nalt=\"Meme with two images, one says 'Our hands look like this..' representing heavily used keyboards and tobaco stained fingers, the other says 'So yours can look like this' with a picture of a hand with a glowing orb in the middle.\"\nwidth={orbMeme.width}\nheight={orbMeme.height}\nstyle={{\nwidth: \"27rem\",\ndisplay: \"flex\",\nmargin: \"0 auto\",\nmaxWidth: \"100%\",\nleft: 0,\n}}\n/&gt;</p>\n<p>I also decided to use a photo of my hand and use a dither filter using https://doodad.dev/dither-me-this, personally it would look better with more contrast, but for an initial version it looks good enough, the hand it's also divided in two different layers to make give the impression to be between the fingers.</p>\n<h2>Final touches</h2>\n<p>I added some other changes like turning the direction of the flow according to the mouse position, and some minor change that probably nobody will ever notice, to do the same using the device orientation on phones.</p>\n<pre><code>window.addEventListener(\n  \"deviceorientation\",\n  (event) =&gt; {\n    leftToRight = event.gamma;\n  },\n  true\n);\n</code></pre>\n<p>There are some other minor changes like stacked shadows to make it look more like glass and a shine in the background.</p>\n<p>As an Easter egg, I also made it show some basic animation if JavaScript it's disabled.</p>\n<p>&lt;video width=\"400\" autoplay loop style={{ maxWidth: \"100%\", display: \"flex\", margin: \"0 auto\" }}&gt;\n&lt;source src={noJsOrb} type=\"video/webm\" /&gt;\n&lt;/video&gt;</p>\n","tags":["javascript","logo","orb","p5","animation","flow field","chromatic-aberration","noise","dither"]},{"id":"https://dobla.do/blog/old-media-feels-new/","title":"Old media feels new","url":"https://dobla.do/blog/old-media-feels-new/","summary":"Lately, I get the feeling that most of the entertainment I want to consume has already been made.","date_published":"2025-02-02T00:00:00.000Z","content_html":"<p>import YoutubeVideo from \"#astro/components/YoutubeVideo.astro\";</p>\n<p>Once a coworker jokingly said <em>“Why watch movies if all of them are some variation of Shakespeare's plays?\"</em>, there’s some truth to that, most movies and shows follow the same arc, and you know what’s coming all along; Even when there are still many ways to say the same in beautiful and slightly different ways, repetition is something you can feel.</p>\n<p>Which made me think <em>“If the content is already made, maybe I can find it in other ways”</em>, and maybe closer to the source. Most of the time the original is better than the reboot, and with this thought, I started to look for older content on archiving platforms.</p>\n<p>I stumbled upon <a href=\"https://de.wikipedia.org/wiki/The_Dick_Van_Dyke_Show\">The Dick Van Dyke Show</a> thanks to <a href=\"https://kottke.org/24/12/0045909-you-can-watch-the-first-1\">this article</a>, and gave a try to the first episode.</p>\n<p>I have to say I was completely entertained during the whole episode. Besides the “oddity” of being in black and white, the way it flows felt different; The actors complete their sentences, and other actors react within the same scene without any cuts! There’s some higher quality in their acting compared to contemporary shows, probably due to the cost of film and the difficulty of editing at the time, where they had to put more effort into doing their bits in one take than now where every pixel and sound can be edited.</p>\n<p>&lt;YoutubeVideo\nloading=\"eager\"\nvideoId=\"XHXG25zKhCI\"\nvideoTitle=\"The Dick Van Dyke Show\"\n/&gt;</p>\n<p>Somehow a show from the 60s felt modern and connected me more to people that are far away from my generation. I used to think <a href=\"https://en.wikipedia.org/wiki/Seinfeld\">Seinfeld</a> was a more innovative show when it came, creating this kind of sitcom, but turns out it’s not so different from The Dick Van Dyke show. Both have a protagonist with 2 friends that struggle with social situations and are comedians, while having similar locations. Both shows are good, but the similarities really surprised me.</p>\n<p>The same happens with books that have been written even thousands of years ago. <a href=\"https://en.wikipedia.org/wiki/Meditations\">Meditations</a> by <a href=\"https://en.wikipedia.org/wiki/Marcus_Aurelius\">Marcus Aurelius</a> has the same issues we face nowadays. If written with modern language you could not see how ancient this book is. His problems are the same as our problems, we struggle the same way and not much has changed.</p>\n<p>What I want to say is that there’s not so much disconnect between current and older generations, and their content is not so different from what we might find in the present.</p>\n<p>Could be that my feeling of boredom with new content is simply Juvenoia, a term I learned in this great <a href=\"https://www.youtube.com/watch?v=LD0x7ho_IYc\">VSauce video</a>, but in this case, I think my worry with content is justified. As it’s easier to produce content we are more likely to produce garbage, or simply to put less effort, which is basically why I’m not looking forward to consuming any AI-generated content.</p>\n<blockquote>\n<p><a href=\"https://en.wiktionary.org/wiki/juvenoia\">Juvenoia</a>: The fear or hostility directed by an older generation toward a younger one, or toward youth culture in general.</p>\n</blockquote>\n<p>Right now I can find old media on <a href=\"https://archive.org/\">Archive.org</a>, directly on <a href=\"https://www.youtube.com/\">YouTube</a> or even downloading it (I won’t feel bad for downloading a movie where most of the cast is already dead).</p>\n<p>For reading, https://standardebooks.org/ provides me with many good books. You can even <a href=\"https://standardebooks.org/bulk-downloads\">bulk download</a> their library, which should basically supply a lifetime of books.</p>\n<p>With this feeling, I stopped my Netflix subscription. I'm finding enough good free content to fill out my entertainment. The first issue I thought I would encounter is that there’s rarely people who consume the same content around me, and it’s definitely harder to talk with coworkers about shows, but due to fragmentation in streaming this was rarely happening.</p>\n<p>Even popular shows that I enjoy and have become quite popular, <a href=\"https://en.wikipedia.org/wiki/Severance_(TV_series)\">Severance</a> in this case is mostly unknown to my coworkers because it's only available on Apple TV. I still enjoy new shows, but there’s a lot of old content already made that I can extract value.</p>\n<p>Somehow taking this route feels more relaxing than going to the next popular thing, and humbles my thoughts about my generation being smarter simply because we have the internet now.</p>\n<p>This Arthur C. Clarke video really says a lot about the imagination of past generations vs ours now.</p>\n<p>&lt;YoutubeVideo\nvideoId=\"YwELr8ir9qM\"\nvideoTitle=\"1964: Arthur C Clarke Predicts the Future | Horizon | Past Predictions | BBC Archive\"\n/&gt;</p>\n<blockquote>\n<p>That is why the future is so endlessly fascinating because try as we can, we'll never outguess it.</p>\n</blockquote>\n","tags":["opinion","entertainment","shows","books","movies","content","internet"]},{"id":"https://dobla.do/blog/reading-books-on-my-phone/","title":"Reading books on my phone","url":"https://dobla.do/blog/reading-books-on-my-phone/","summary":"While physical books are great, I prefer reading on my phone","date_published":"2023-08-17T00:00:00.000Z","content_html":"<p>What started as a test has become a habit, my mentality used to be \"reading physical books is better than digital\", because we like to follow the motto:</p>\n<blockquote>\n<p>reject modernity, 𝖊𝖒𝖇𝖗𝖆𝖈𝖊 𝖙𝖗𝖆𝖉𝖎𝖙𝖎𝖔𝖓</p>\n</blockquote>\n<h2>Kindle experience</h2>\n<p>But after buying my first <a href=\"https://www.amazon.com/Kindle-Paperwhite-reader-Previous-Generation/dp/B00QJE3MGU\">Kindle (7st gen)</a>, modernity had some good points, I preferred physical books, but a lot of the convenience of the Kindle made me continue digital.</p>\n<p>Firstly, the progress bar, the psychological effect that it has on me telling me \"&lt;tt&gt;there are only 10 pages left in the chapter&lt;/tt&gt;\" is motivation enough to keep me reading until the end of a chapter.</p>\n<p>Immediately starting to read the book with the click of a button or leaving it without having to worry about losing the page, means I can read in short bursts, like when I'm waiting for the bus.</p>\n<p>But still, the Kindle wasn't as good as a book, the screen was small, the refresh rate was too slow, and reading at night still required a light (I had a model without a backlight).</p>\n<p>Transferring books was annoying, I kept the Kindle almost always on airplane mode to save battery, so I had to connect it to my computer to transfer books with <a href=\"https://calibre-ebook.com/\">Calibre</a> or connect it to Wi-Fi to transfer books with email or the Amazon store, and while it was not a big deal, it was still annoying.</p>\n<p>Although the battery life was amazing, it was still another device to charge and carry around, with its own inconveniences.</p>\n<h2>Phone experience</h2>\n<p>I tried to use my phone as my main reading device after accidentally stepping on my Kindle, which unfortunately didn't survive. Sometimes misfortune brings new opportunities.</p>\n<p>Turns out I always carry my phone with me; just the mental barrier of having to carry my kindle was enough to make me read less.</p>\n<p>Now I have the reading app very prominent on my phone screen, reminding me to read, meaning I have many short bursts of time to read before a meeting, while commuting, or while shopping, with the advantage that it's time that otherwise would be wasted with some social media app.</p>\n<p>The screen is way better; yes, it's not e-ink, yet the backlight makes it easier to read in the dark, and the refresh rate and resolution are miles ahead of any e-ink device. I don't get much strain from reading on screens like my phone or laptops, so this was not a problem for me, but I understand others might find it inconvenient.</p>\n<p>My current phone might not be lighter than my Kindle device, but it's definitely smaller; even the smallest Kindle device looks goofy in a pocket.</p>\n<p>One of the best parts was using <a href=\"https://play.google.com/store/books?hl=en&amp;gl=US\">Google Play Books</a> I'm not sure how, but they just let you upload any files you want and sync them over the internet for free. Just by navigating to <a href=\"https://play.google.com/books/uploads\">Play Books upload</a> and dragging the book, it automatically sends the book to all your devices and keeps them in sync, one of those services that just works.</p>\n<p>And the app it's good, integrating dictionary, notes, good UI, and a must have feature, using the volume buttons to turn pages.</p>\n<h2>Physical book experience</h2>\n<p>While I still buy physical books, most of the time I get the same book digitally just to read at night while my partner sleeps.</p>\n<p>The transport of a huge book, the need for light to see properly, and how annoying is to turn the pages at the start and end of a thick book are problems that I want to let go of.</p>\n<p>I will miss the smell, the sense of physical progress, the uncontested battery life, and the feeling of having a bookshelf, but I think I can live without them.</p>\n<h2>Conclusion</h2>\n<p>I try to be pragmatic, and while nostalgia is a huge component here, what made me read more during these past 4 years was my phone and the convenience that brings, so I'll keep doing it.</p>\n<p>Who knows, maybe in the future we can have screens in our retinas, and I will write this post again.</p>\n<p></p>\n","tags":["opinion","reading","books","phone","apps","kindle","productivity"]},{"id":"https://dobla.do/blog/simplifying-browser-extensions-with-tampermonkey/","title":"Simplifying browser extensions with Tampermonkey","url":"https://dobla.do/blog/simplifying-browser-extensions-with-tampermonkey/","summary":"A brief introduction to Tampermonkey as an alternative to extensions.","date_published":"2023-08-28T00:00:00.000Z","content_html":"<h2>Introduction</h2>\n<p>Not long ago, a coworker sent me the code of an extension he made, he did a wonderful work, and I loved how he came up with a better and simpler solution to the problem that I was overengineering. Unfortunately, the extension was only compatible with <em>Firefox</em> and I use <em>Chrome</em>.</p>\n<p>Initially, I thought it was going to be a matter of adapting the manifest a bit to make it work on <em>Chrome</em>, but it was not that simple; even when using the same manifest version, the way background scripts are loaded is different for each browser.</p>\n<p>Also, some parts of the code were incompatible with <em>Chrome</em>, for example, how the messages could be awaited in <em>Firefox</em>.</p>\n<p>I did end up porting the code, but it was not a simple task and left me wondering why it was so cumbersome to make an extension compatible with both browsers.</p>\n<p>After all, the changes to the extension APIs are meant to close the gap between browsers, but it seems to be a way to remove some of the more powerful APIs that get in the way of blocking advertisements.</p>\n<p>Overall, I'm very disappointed with the developer experience of web extensions. Porting <a href=\"https://github.com/dobladov/youtube2Anki\">Youtube2Anki</a> to manifest <code>v3</code> was a lot of work with no benefits to the users, and with the drawback that I have to keep two different versions for <em>Firefox</em> (still <code>v2</code>) and <em>Chrome</em>, all these problems got me thinking about what I can do as an alternative.</p>\n<h2>Why Tampermonkey</h2>\n<p><a href=\"https://www.tampermonkey.net/\">Tapermonkey</a> allows you to execute scripts and styles on any site, exactly what a custom extension does, but it has some advantages:</p>\n<p>The development is much easier; it requires less boilerplate, and it's effortless to debug due to not having multiple contexts handling many of the tedious permissions for you.</p>\n<p>On top of it, it reloads after saving the changes of a <em>Tampermonkey</em> script; there's no need to reload the extension; just refresh the page and the changes are applied. This means faster iterations and less time wasted.</p>\n<p>In my case, I had three requirements.</p>\n<ol>\n<li>I needed to be able to inject a script at a specific URL.</li>\n<li>Send notifications to the user.</li>\n<li>Open a URL in a new tab.</li>\n</ol>\n<p>Tampermonkey allows me to do all of this.</p>\n<p>The permissions only require adding some <a href=\"https://www.tampermonkey.net/documentation.php?locale=en#meta:grant\">grants</a>.</p>\n<pre><code>// @grant        GM_notification\n// @grant        GM_openInTab`\n</code></pre>\n<p>And executing only in the URL is as simple as <code>// @match  [your URl]</code></p>\n<p>After porting the logic, what used to be basically an app with multiple files, setup, packaging, etc, became a single file with a few lines of code that just focused on doing what it needed to do.</p>\n<p>Not only that, but there was no need for boilerplate to send data back and forth between the background script and the content script, and notifications could be simplified by not requiring a <code>tabId</code>.</p>\n<p>And the best part is that there are no differences between <em>Firefox</em> and <em>Chrome</em>; they both run the same script and execute the same functionality.</p>\n<h2>Other usages</h2>\n<p>I have incorporated <em>Tampermonkey</em> into my work to the point that some other of my coworkers use it now, mostly dev code that we don't want to deliver to production.</p>\n<p>For example, as a quick way to set special cookies or log users without a form, since most of the scripts only require a file, we can easily share them as a <a href=\"https://gist.github.com/\">gist</a>, and they can be easily installed by anyone.</p>\n<h2>Conclusion</h2>\n<p>I would only consider <em>Tampermonkey</em> a tool for developers; there are many cases where a full extension is needed, but for quick hacks or to avoid the hassle of maintaining multiple versions of the same extension, it's a great tool.</p>\n<p></p>\n","tags":["programming","javascript","tampermonkey","extensions","chrome","firefox"]},{"id":"https://dobla.do/blog/ssr-with-bun-and-react/","title":"SSR with Bun and React","url":"https://dobla.do/blog/ssr-with-bun-and-react/","summary":"How to set up a server side rendered app using Bun, react and react-router","date_published":"2025-01-28T00:00:00.000Z","content_html":"<p>The goal is to have a server able to stream React Components directly from the server using the client for navigation, removing the need to request data from the server after the first load, some call it <em>\"Universal Data Fetching\"</em> or <em>\"Isomorphic Data Fetching\"</em>.</p>\n<blockquote>\n<p>This pattern ensures that the data required to render a page is fetched on the server during the initial request and then re-fetched or reused on the client side for subsequent interactions.</p>\n</blockquote>\n<p>The full repository with the code can be seen in <a href=\"https://github.com/dobladov/bun-ssr-react\">dobladov/bun-ssr-react</a>, I’ll be omitting all imports to keep the snippets shorter.</p>\n<p><strong>⚠️ Disclaimer</strong>: I'm not implementing <a href=\"https://react.dev/reference/rsc/server-components\">React Server Components</a>, but good old React hydrated on the client.</p>\n<p>I want to mention another repo that is doing similar logic, but all responses come from the server: <a href=\"https://github.com/alexkates/ssr-bun-react/blob/main/index.tsx\">alexkates/ssr-bun-react</a>, a good approach if you want to have a more traditional SSR.</p>\n<h2>Why did I choose Bun?</h2>\n<p>It’s a batteries-included tool, if you had to make SSR work with webpack and node, you might know how much of a pain it is to deal with JSX in both the server and client, then add other issues like babel plugins, common JS modules vs ESM and you realize most of the setup exists to fix issues related to JavaScript instead of focusing on writing code.</p>\n<p>Bun solves all of those directly for you, including the server, although you might want to use <a href=\"https://elysiajs.com/\">Elysia</a> or <a href=\"https://expressjs.com/\">Express</a> for more complex apps.</p>\n<p>I have to be honest, so far I’m not using <a href=\"https://bun.sh/\">Bun</a> at work or in any projects that are critical, only side projects and occasional scripts, but I love it so far, and the only thing that worries me is the company behind it cutting funding or trying to lock you in their ecosystem or the main developers leaving the project, because wow, what an incredible job they are making with such a small team.</p>\n<p>In any case, it’s a project that’s forcing <a href=\"https://nodejs.org/en\">Node</a> and <a href=\"https://deno.com/\">Deno</a> to improve themselves and this competition so far brings many new functionalities that make my work easier.</p>\n<h2>Build process</h2>\n<p>We start by creating a new bun project and adding the dependencies</p>\n<pre><code>mkdir example-bun-ssr\ncd example-bun-ssr\nbun init\n# package name (example-bun-ssr):\n# entry point (index.ts): src/index.tsx\nbun add react react-dom react-router\n</code></pre>\n<p>Let’s add a script to <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/package.json\">package.json</a> to run in dev mode and also watch for changes.\nIf you wonder why <code>.tsx</code> is because I want to have <a href=\"https://react.dev/learn/writing-markup-with-jsx\">JSX</a> directly in this file.</p>\n<pre><code>  \"scripts\": {\n    \"dev\": \"bun run --watch src/index.tsx\"\n  },\n</code></pre>\n<p>We need an entry point for the client build and to generate it to our public folder, we can start by adding this to <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/index.tsx\">src/index.tsx</a>.</p>\n<pre><code>Bun.build({\n    entrypoints: ['./src/client.tsx'],\n    outdir: 'src/public/'\n})\n</code></pre>\n<h2>Client logic</h2>\n<p><a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/client.tsx\">src/client.tsx</a> has two goals, to <a href=\"https://react.dev/reference/react-dom/client/hydrateRoot\">hydrate</a> React once the file is loaded so we can interact with the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model\">DOM</a> on the client, and to generate the routing for client navigation.</p>\n<p>&lt;details&gt;\n&lt;summary&gt;Rant about react-router&lt;/summary&gt;\nI’m very disappointed with the approach of react-router for their docs, they definitely care about the project and add cool functionality, but I find the docs completely lacking and confusing, I can’t link any of the next functions that I’m mentioning, there are barely any examples of how to do SSR, and the framework vs library approach is confusing to even people experienced in using it, there are also many methods that I can’t even find in the API reference even when they are not deprecated, the only way I found to understand how to implement this was to do searches in the repo.</p>\n<p>For next projects I will look at alternatives like <a href=\"https://tanstack.com/router/latest\">TanStack Router</a>.\n&lt;/details&gt;</p>\n<p>We need <code>&lt;RouterProvider&gt;</code> to create a router that can use loaders otherwise a simple <code>&lt;BrowserRouter&gt;</code> would be enough.</p>\n<p><code>createBrowserRouter</code> is equivalent to <code>&lt;BrowserRouter&gt;</code>, but we need to call it this way for our purpose and I like to use <code>createRoutesFromElements</code> because I find JSX more intuitive for nested routes.</p>\n<pre><code>const root = document.getElementById('root');\n\nif (root) {\n    hydrateRoot(root, (\n        &lt;RouterProvider router={\n            createBrowserRouter(\n                createRoutesFromElements(\n                    Routing()\n                )\n            )\n        } /&gt;\n    ));\n}\n</code></pre>\n<h2>Routes</h2>\n<p>Our routes can be very simple, in <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/routes.tsx\">src/routing.tsx</a> we have the following, note that we will re-use this file for server and client which gives us a very clean way to handle our app with minimal config.</p>\n<p>An <code>errorElement</code> to act as an <a href=\"https://react.dev/reference/react/Component#catching-rendering-errors-with-an-error-boundary\">error boundary</a>.</p>\n<p><code>&lt;Route&gt;</code> for each of the routes and inside the only more unusual prop is <code>loader</code>, used to get the data before the route is loaded.</p>\n<pre><code>export const Routing = () =&gt; {\n  return (\n    &lt;Route errorElement={&lt;ErrorPage /&gt;}&gt;\n        &lt;Route\n          path=\"/\"\n          element={&lt;Home /&gt;}\n          loader={getData}\n        /&gt;\n        &lt;Route path=\"/about\" element={&lt;About /&gt;} /&gt;\n        &lt;Route path=\"*\" element={&lt;NotFound /&gt;} /&gt;\n      &lt;/Route&gt;\n  )\n}\n</code></pre>\n<p>The components are really simple:</p>\n<pre><code>// https://github.com/dobladov/bun-ssr-react/blob/main/src/ErrorPage.tsx\nexport const ErrorPage = () =&gt; {\n    const error = useRouteError();\n\n    return (\n        &lt;div&gt;\n            &lt;div&gt;Something went wrong&lt;/div&gt;\n            &lt;pre&gt;{JSON.stringify(error, null, 2)}&lt;/pre&gt;\n            &lt;Link to=\"/\"&gt;Go back to home&lt;/Link&gt;\n        &lt;/div&gt;\n    )\n}\n</code></pre>\n<p><code>useLoaderData</code> will give us the data requested in the <code>loader</code> prop</p>\n<pre><code>// https://github.com/dobladov/bun-ssr-react/blob/main/src/Home.tsx\nexport const Home = () =&gt; {\n    const data = useLoaderData&lt;InitialData&gt;();\n\n    useEffect(() =&gt; {\n        console.log('Home loaded');\n    }, []);\n\n    return (\n        &lt;div&gt;\n            &lt;h1&gt;Home&lt;/h1&gt;\n            &lt;pre&gt;{JSON.stringify(data, null, 2)}&lt;/pre&gt;\n            &lt;Link to=\"/about\"&gt;About&lt;/Link&gt;\n        &lt;/div&gt;\n    )\n};\n</code></pre>\n<pre><code>// https://github.com/dobladov/bun-ssr-react/blob/main/src/About.tsx\nexport const About = () =&gt; {\n    \n    useEffect(() =&gt; {\n        console.log('About loaded')\n    }, [])\n\n    return (\n        &lt;div&gt;\n            &lt;h1&gt;About&lt;/h1&gt;\n            &lt;Link to=\"/\"&gt;Home&lt;/Link&gt;\n        &lt;/div&gt;\n    )}\n</code></pre>\n<pre><code>// https://github.com/dobladov/bun-ssr-react/blob/main/src/NotFound.tsx\nexport const NotFound = () =&gt; (\n  &lt;div&gt;\n    &lt;h1&gt;404 - Page Not Found&lt;/h1&gt;\n    &lt;p&gt;Sorry, the page you are looking for does not exist.&lt;/p&gt;\n    &lt;Link to=\"/\"&gt;Go to Home&lt;/Link&gt;\n  &lt;/div&gt;\n);\n</code></pre>\n<p>To get the data, we need <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/utils.ts\">src/utils.ts</a> with a simple async function that calls an API we will create later on the server.</p>\n<pre><code>export const getData = async () =&gt; {\n    const response = await fetch('http://localhost:5000/api/example')\n    const json = (await response.json()) as InitialData;\n    return json\n}\n</code></pre>\n<p>Congrats we wrote most of our app, at least the client, we could easily use Bun’s newest <a href=\"https://bun.sh/blog/bun-v1.2#html-imports\">HTML static import</a> and have a client side rendered react app, but we are here to aim for the stars and to do SSR, so let’s do that now and create the server.</p>\n<h2>Server logic</h2>\n<p>We are again back to <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/index.tsx\">src/index.tsx</a>, take a moment to appreciate how simple the code is.</p>\n<p>We need to create a server that listens on a port, and we have some basic path name matching the incoming URL, that's it.</p>\n<pre><code>const server = Bun.serve({\n    port: 5000,\n    async fetch(req) {\n      const {pathname} = new URL(req.url);\n      console.info(`Requesting: ${pathname}`);\n\n      // 1. Static assets\n      if (pathname.startsWith(\"/public/\")) {\n        const file = Bun.file(__dirname + pathname);\n        return new Response(file);\n      }\n\n      // 2. Example API\n      if (pathname === '/api/example') {\n        return Response.json({ message: 'Hello, World!' });\n      }\n\n      const routes = createRoutesFromElements(Routing());\n      \n      let { query, dataRoutes } = createStaticHandler(routes);\n      let context = await query(req) as StaticHandlerContext;\n      let router = createStaticRouter(dataRoutes, context);\n\n      // 3. Server-side rendering\n      const stream = await renderToReadableStream(\n          &lt;App&gt;\n            &lt;StaticRouterProvider\n              router={router}\n              context={context}\n            /&gt;\n          &lt;/App&gt;,           \n        );\n        return new Response(stream, {\n          headers: { \"Content-Type\": \"text/html\" },\n        });\n    },\n  });\n\nconsole.info(`Listening on http://localhost:${server.port}`);\n</code></pre>\n<p>Let’s analyze each match:</p>\n<ol>\n<li>Allows to serve our static assets in the public folder including the client build generated at the beginning with <code>Bun.build</code>, our CSS, favicon, images can be served this way.</li>\n<li>Just an example of a JSON API, that both client and server can request.</li>\n<li>Here comes the magic that makes SSR possible, we re-use the client routes with <code>createRoutesFromElements</code>, and we need <code>createStaticHandler</code> and <code>createStaticRouter</code> again here because we use a <code>loader</code> prop in our <code>Routes</code>.</li>\n</ol>\n<p>Once we have created the routing, we can stream the App with <a href=\"https://react.dev/reference/react-dom/server/renderToReadableStream\">renderToReadableStream</a>.</p>\n<p>We miss only one last component, <a href=\"https://github.com/dobladov/bun-ssr-react/blob/main/src/App.tsx\">src/App.tsx</a>, which is an HTML wrapper where we render the server components and load our client.</p>\n<pre><code>export const App = (props: Props) =&gt; {\n    return (\n        &lt;html lang=\"en\"&gt;\n            &lt;head&gt;\n                &lt;meta charSet=\"UTF-8\"/&gt;\n                &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"/&gt;\n            &lt;/head&gt;\n            &lt;body&gt;\n                &lt;div id=\"root\"&gt;{props.children}&lt;/div&gt;\n                &lt;script type=\"module\" src=\"/public/client.js\"&gt;&lt;/script&gt;\n            &lt;/body&gt;\n        &lt;/html&gt;\n    )\n}\n</code></pre>\n<p>And we are ready, <code>bun run dev</code> should launch the server and provide the URL <a href=\"http://localhost:5000/\">http://localhost:5000</a> where we can check our app.</p>\n<h2>Retrospective</h2>\n<p>As mentioned I like how simple everything is, at least compared to another production project at work with the same goal using node, express and webpack, this is far more maintainable, the build is faster and overall improves in all areas, with less dependencies.</p>\n<p>I will definitely use Bun more and more if they continue providing so much value out of the box, at the moment I'm working on a side project that relies on their <a href=\"https://bun.sh/docs/api/sqlite\">SQLite</a> implementation and I'm very happy with it.</p>\n<p></p>\n","tags":["javascript","deno","node","bun","ssr","react","development","programming","deno"]},{"id":"https://dobla.do/blog/supporting-old-browsers/","title":"Supporting old browsers","url":"https://dobla.do/blog/supporting-old-browsers/","summary":"The process of debugging and supporting an old iOS browser","date_published":"2025-01-07T00:00:00.000Z","content_html":"<h2>The problem</h2>\n<p>I reached a point at work where I have to support old iOS versions, and by old I mean iOS 13, which at the moment of writing this post is 5 years old. If you have to ask me, this is a waste of resources for a very small amount of users and while I made this point clear, this is my job, and it has to be done.</p>\n<p>So now on, each release and each upgrade of packages will require testing on devices that even the manufacturers themselves don’t care about anymore. Even worse, we have to keep devices that could be upgraded to another major version locked in old versions.</p>\n<p>The device I’m using right now is an <em>iPhone 8</em> running <code>iOS 13.5.1</code> which is upgradable at least to version <code>16</code>, a device released in 2017 and not supported anymore by Apple.</p>\n<h2>Identifying the parse error</h2>\n<p>After upgrading to <code>react-redux@9.2.0</code> this old phone is incapable of parsing the bundle, with a very unhelpful message, even with source maps.</p>\n<p></p>\n<p>We know that some token can’t be read causing the whole app to crash, meaning that one character in the bundle is code that was not supported in this version of iOS. How do we find the precise code?</p>\n<p>In this case, I was able to narrow it to the packages updated. If this was not possible, let’s say an existing codebase would need to be adapted to work on old devices, some other debug can be added like including comments with the name of the modules imported to see where it breaks.</p>\n<p></p>\n<p>Getting closer but how do we know the precise line of code? Bundling in this case removed all the information. Once I knew that <code>./node_modules/react-redux/dist/react-redux.mjs</code> was the real issue, the next step was to recreate it on a smaller setup.</p>\n<pre><code>&lt;!DOCTYPE html&gt;\n&lt;html lang=\"en\"&gt;\n&lt;head&gt;\n    &lt;meta charset=\"UTF-8\"&gt;\n    &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"&gt;\n    &lt;title&gt;Document&lt;/title&gt;\n&lt;/head&gt;\n\n&lt;body&gt;\n    Debugging react-redux on iOS 13\n    &lt;script type=\"module\"&gt;\n        import './react-redux.mjs'\n    &lt;/script&gt;\n&lt;/body&gt;\n&lt;/html&gt;\n</code></pre>\n<p>Once serving this file and accessing it from the device, the error was much more clear, I could see the line causing the issue.</p>\n<pre><code>  const contextMap = gT[ContextKey] ??= /* @__PURE__ */ new Map();\n</code></pre>\n<p>In this case, the operator <code>??=</code> <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Nullish_coalescing_assignment\">Nullish coalescing assignment</a> was not supported at this version of iOS: <a href=\"https://caniuse.com/?search=Nullish%20coalescing%20assignment\">Can I use Search\nNullish coalescing assignment ?</a></p>\n<h2>Fixing the code</h2>\n<h3>Manual Patching</h3>\n<p>There are various routes to get the problem solved, a simple one would be to patch the library in <code>node_modules</code>. Initially, I did it manually to make sure that was the solution for running <code>react-redux</code> on the device simply changing the line of code for:</p>\n<pre><code>//const contextMap = gT[ContextKey] ??= /* @__PURE__ */ new Map();\nconst contextMap = gT[ContextKey] = gT[ContextKey] === undefined || gT[ContextKey] === null \n  ? /* @__PURE__ */ new Map() \n  : gT[ContextKey];\n</code></pre>\n<p>The patch can be more <em>permanent</em> using <code>npx patch-package</code>: <a href=\"https://stackoverflow.com/questions/72820625/what-is-the-proper-way-to-patch-a-node-modules-module/77385111#77385111\">Stack overflow - Patch a \"node_modules\" (Node.js) module</a></p>\n<p>This could be a good hotfix, but we want it fixed for future cases.</p>\n<h3>Creating a pull request</h3>\n<p>Second solution, to create a PR in the <code>react-redux</code> project and use less modern JavaScript, this solution is far from ideal. I don’t like to write older code, we should look at the future and while it does make the library more compatible I would have to justify and convince them to merge it, so I decided not to do it.</p>\n<p><a href=\"https://github.com/reduxjs/react-redux/blob/7e2fdd4ee2021e4282e12ba9fc722f09124e30cd/src/components/Context.ts#L31\">Line of code to change</a></p>\n<h3>Babel plugins</h3>\n<p>Third solution, transpile the library using <a href=\"https://babeljs.io/\">Babel</a> to more widely supported JavaScript automatically using plugins, and here is where the issue got more confusing. The project already used Babel to do exactly this, in fact <code>@babel/preset-env</code> includes the two plugins that are required to make the failing file work <a href=\"https://babeljs.io/docs/babel-plugin-transform-nullish-coalescing-operator\">@babel/plugin-transform-nullish-coalescing-operator</a> and <a href=\"https://babeljs.io/docs/babel-plugin-transform-logical-assignment-operators\">@babel/plugin-transform-logical-assignment-operators</a>, but somehow after a build the file ended intact and still containing <code>??=</code>.</p>\n<p>So what was happening? We had to transpile <code>react-redux</code> in the past to support other issues, as I could see in the webpack file <code>resolve(__dirname, 'node_modules/react-redux')</code> was in the <code>include</code> for <code>babel-loader</code>.</p>\n<p>Well, the newer version of the package uses JS modules, and now the extension of the file was <code>.mjs</code> instead of <code>.js</code> meaning that the regex to match the files was completely ignoring the file <code>/\\.(js|jsx)$/</code>. After simply adding <code>/\\.(js|jsx|mjs)$/</code> the file was correctly parsed and worked on iOS 13.</p>\n<h2>Conclusion</h2>\n<p>It’s important to understand how other people’s code end up in your build. In this case, I learned how to better debug third-party code with Safari which is not fun, how to adapt code to work in devices that were not supposed to work with it, and how to make sure that the code is transpiled correctly.</p>\n<p>I hope this post helps someone in the future, at the very least was useful for a small subset of users that still use old devices.</p>\n<p></p>\n","tags":["maintenance","javascript","ios","babel","redux","debugging"]},{"id":"https://dobla.do/blog/why-there-are-no-posts-this-year/","title":"Why there are no posts this year","url":"https://dobla.do/blog/why-there-are-no-posts-this-year/","summary":"A reflection on the year and why I decided to not post during 2024","date_published":"2024-12-28T00:00:00.000Z","content_html":"<h2>Blogging about blogging</h2>\n<p>I realized most of the drafts I wrote in 2024 were about blogging, while some meta might be interesting including this post, I don't want to be the guy that only talks about blogging, the purpose of blogging should be for sharing knowledge and experiences, not for explaining how to blog, probably Aristotle would have wrote this in his blog, but I'm not Aristotle.</p>\n<blockquote>\n<p>“The Purpose of <s>Knowledge</s>Blogging is Action, not <s>Knowledge</s>Blogging” Aristotle</p>\n</blockquote>\n<p>This led me to delete those drafts, and I don't have any regrets, in fact nothing that you can find anywhere else was lost.</p>\n<h2>Negativity</h2>\n<p>Some of the other drafts talked about the <a href=\"https://en.wikipedia.org/wiki/Dead_Internet_theory\">dead internet</a>, and how I'm less and less interested in the internet, and this is true, during 2024 I both gave another try to social networks and gave up, I deleted my Twitter account due to the amount of negativity there, rarely finding anything new and interesting, the only thing I miss is the creativity of gamedev and programmers, but more and more of the content was simply commercial, rarely there's people who simply are proud of their work and want to share it, instead everyone was selling something including me even if I made no money out of it.</p>\n<p>Then I tried Mastodon and BlueSky, in Mastodon, the content felt completely unappealing to me, maybe because I chose <a href=\"https://mastodon.social/explore\">mastodon.social</a> for my instance, politics, cat pics and rights are the more common topics and I like that others have a place to discuss them but I'm not interested, definitely a more tech-focused instance would have been better for me, but fragmentation and content made me give up on it.</p>\n<p><a href=\"https://bsky.app/\">BlueSky</a> felt somehow better, I liked the idea behind their protocol, I think they do moderation in a good way, and it feels like a good alternative to Twitter, but again I'm not sure if I chose the wrong people to follow, but most of the content was meta about the protocol, cats, and politics.</p>\n<p>I even invested some time to understand how their <a href=\"https://atproto.com/\">AT protocol</a> works, I love how they use domains as handles and other ideas of owning your data, but given that they still need to implement important parts of the protocol like scopes developing something on it didn't feel right at the moment.</p>\n<p>Which led me to think \"What am I doing with my time\"? I consume all this content that I don't even enjoy, and then deleted the accounts.</p>\n<p>Ironically <a href=\"https://www.instagram.com/\">Instagram</a> is the only social network of any value for myself now, only following people I know and avoiding reels and other never-ending content, I simply have it on my phone (web app) with a timer to limit how much I use it; this keeps me connected to my friends and family which is real value, I do hate that it is owned by Meta, but both posting and commenting to people I care increases my connection to them.</p>\n<p>In general my only social interactions beside the mentioned are some occasional comments on <a href=\"https://news.ycombinator.com/\">Hacker News</a> and searches on Reddit but they are so sporadic that they barely count.</p>\n<h2>Focusing on what matters</h2>\n<p>Given that I don't like the web so much, the best thing I could do in 2024 was to get away from it and focus on other things, I started to take Calisthenics more seriously which had the best outcome possible, this year to my surprise, I can do some Calisthenics tricks, like handstands, muscle-up, L-sit, and my physique is great, the amount of benefits to my body have been amazing and training has become a highlight of the day where I feel great instead of being a hurdle, in fact I'm training so much that I have to take periods of healing, which is a good problem to have and I'm reducing with more knowledge about the topic.</p>\n<p>Because of the content I found on the Internet is not interesting I moved more to reading books, and more importantly, now I allowed myself to abandon books that I don't find interesting which was killing my will to read, this boosted my other hobbies with amazing books like <a href=\"https://stevenlow.org/overcoming-gravity/\">Overcoming Gravity</a>, never have I read a more well-written book about sports being a topic I never thought it could be interesting in reading, I'm reading more of what amuses me instead of feeling I need to learn something new, focusing on Sci-Fi instead of non-fiction.</p>\n<p>For 2025 I hope to write more about my hobbies and less about the web, focus on what's positive and what I enjoy, and hopefully you enjoy it too.</p>\n","tags":["meta","blogging","social networks"]}]}